const RACES_DATA = [
    {
        "名称": "械灵",
        "类型": "种族",
        "简介": "械灵是具有感知能力的机械生命体，其由包括金属、木头、石头和陶土在内的多种材料构建而成，外观可以与类人生物、动物，甚至是无生命的物体相似",
        "描述": "定制设计: 决定你是由谁创造以及为何目的而创造的。在创建角色时，选择一个最符合此目的的经历，永久获得 +1 加值。\n高效休整: 当你进行短休时，你可以选择一个长休的休整行动代替短休的休整行动。"
    },
    {
        "名称": "龙人",
        "类型": "种族",
        "简介": "龙人的外观类似无翼的龙类，拥有类人形态和强大的元素吐息",
        "描述": "鳞片保护: 你的鳞片提供天然保护。当你受到严重伤害时，你可以**标记 1 压力点**以少**标记 1 生命点**。\n元素吐息: 选择一种元素作为你的吐息（例如电、火或冰）。你可以对邻近范围内的一个或一群目标使用此吐息，将其视为一种使用你的熟练值造成 **d8** 点魔法伤害的本能武器。"
    },
    {
        "名称": "矮人",
        "类型": "种族",
        "简介": "矮人容易被辨识为身材矮小的类人生物，体格方正，肌肉结实，毛发浓密",
        "描述": "厚实皮肤: 当你受到轻度伤害时，你可以**标记 2 压力点**代替**标记 1 生命点**。\n增强坚韧: **花费 3 希望点**，将受到的物理伤害减半。"
    },
    {
        "名称": "精灵",
        "类型": "种族",
        "简介": "精灵通常是身材高挑的类人生物，拥有尖尖的耳朵和异常敏锐的感官",
        "描述": "快速反应: **标记 1 压力点**，在反应掷骰上获得优势。\n天界冥想: 在休息期间，你可以进入冥想状态，选择一个额外的休整行动。"
    },
    {
        "名称": "仙灵",
        "类型": "种族",
        "简介": "仙灵是拥有昆虫特征的带翼人形生物",
        "描述": "运气操控者: 每场游戏一次，在你或一个近距离范围内的自愿盟友进行动作掷骰后，你可以**花费 3 希望点**重新掷二元骰。\n翅膀: 你可以飞行。飞行时，在敌人对你进行攻击之后，你可以**标记 1 压力点**在该攻击中闪避获得 +2 加值。"
    },
    {
        "名称": "羊蹄人",
        "类型": "种族",
        "简介": "羊蹄人类似于长有弯曲的角、方形瞳孔和分蹄的类人山羊",
        "描述": "跳跃: 你可以像使用正常移动一样跳跃到近距离范围内的任何地方，让你轻松跳过障碍物、跨越缝隙或攀爬障碍。\n踢击: 当你对近战范围内的一个目标攻击成功时，你可以**标记 1 压力点**借力将自己踢离目标，造成额外 **2d6** 点伤害，并将你自己或目标击退至邻近范围处。"
    },
    {
        "名称": "费尔博格",
        "类型": "种族",
        "简介": "费尔博格是半牛半类人生物，通常以其宽阔的鼻子和长而下垂的耳朵而闻名",
        "描述": "冲撞: 当你成功进行一次敏捷掷骰，从远距离或极远距离移动到一个或多个目标的近战距离内时，你可以**标记 1 压力点**，对近战距离内的所有目标造成 **1d12** 点物理伤害。\n百折不挠: 当你本应**标记 1 压力点**时，掷一个 **d6**。结果为 6 时，则无需标记。"
    },
    {
        "名称": "孢菌人",
        "类型": "种族",
        "简介": "孢菌人类似人形蘑菇",
        "描述": "孢菌网络: 进行一次 **本能掷骰 (12)**，使用你的菌丝与任何范围的同种族成员交换信息。\n死亡连接: 触摸一具最近死亡的尸体，你可以**标记 1 压力点**，从尸体中提取一个与你选择的特定情绪或感觉相关的记忆。"
    },
    {
        "名称": "龟人",
        "类型": "种族",
        "简介": "龟人有着类似拟人化乌龟的外观，拥有一副巨大而圆润的甲壳，头部和四肢可以缩回其中",
        "描述": "龟甲: 你的伤害阈值获得等同于你熟练值的加值。\n缩壳: **标记 1 压力点**来缩入你的龟壳中。在龟壳中时，你获得物理伤害抗性，但动作掷骰有劣势，并且无法移动。"
    },
    {
        "名称": "巨人",
        "类型": "种族",
        "简介": "巨人是高大的类人生物，肩膀宽阔，手臂修长，拥有一到三只眼睛",
        "描述": "坚韧: 在创建角色时，获得一个额外的生命槽。\n长臂: 将任何近战范围的武器、能力、法术或其他特性视为具有邻近范围。"
    },
    {
        "名称": "哥布林",
        "类型": "种族",
        "简介": "哥布林是体型矮小的人形生物，很容易通过他们的大眼睛和巨大的薄膜状耳朵来辨认",
        "描述": "稳健脚步: 你在敏捷掷骰中忽略劣势。\n危险感应: 每次休息一次，**标记 1 压力点**，强制一个敌人重掷对你或你邻近范围内的盟友的攻击。"
    },
    {
        "名称": "半身人",
        "类型": "种族",
        "简介": "半身人是体型矮小的人形生物，有着毛茸茸的大脚和突出的圆形耳朵",
        "描述": "幸运使者: 每场游戏开始时，你队伍中的所有人皆**获得 1 希望点**。\n内在罗盘: 当你掷出的希望骰结果为 1 时，你可以重掷此次掷骰。"
    },
    {
        "名称": "人类",
        "类型": "种族",
        "简介": "人类最容易辨识的特征是灵巧的双手、圆圆的耳朵以及超强的耐力",
        "描述": "精力充沛: 角色创建时获得一个额外的压力槽。\n随机应变: 当你在运用某个经历进行的掷骰失败时，你可以**标记 1 压力点**进行重掷。"
    },
    {
        "名称": "魔裔",
        "类型": "种族",
        "简介": "魔裔是拥有尖锐犬齿、尖耳朵和犄角的人形生物",
        "描述": "无畏: 当你掷出恐惧结果时，你可以**标记 2 压力点**将其改为掷出希望结果。\n恐怖面容: 你在恐吓敌意生物的掷骰中具有优势。"
    },
    {
        "名称": "猫族",
        "类型": "种族",
        "简介": "猫族是猫科人形生物，拥有可伸缩的爪子、垂直的瞳孔和高耸的三角形耳朵",
        "描述": "猫科本能: 当你进行敏捷掷骰时，你可以**花费 2 希望点**来重掷你的希望骰。\n伸缩猫爪: 进行一次敏捷掷骰来抓挠近战范围内的一个目标。成功时，目标暂时处于**脆弱**状态。"
    },
    {
        "名称": "兽人",
        "类型": "种族",
        "简介": "人形生物之一的兽人最容易辨认的特征是他们方正的面部和从下颚突出的野猪般的獠牙",
        "描述": "强壮: 当你剩余 1 点生命点时，以你为目标的攻击掷骰具有劣势。\n獠牙: 当你对近战范围内的一个目标攻击成功时，你可以**花费 1 希望点**用獠牙刺击目标，额外造成 **1d6** 点伤害。"
    },
    {
        "名称": "蛙裔",
        "类型": "种族",
        "简介": "蛙裔形似拟人化的青蛙，突出的眼睛和蹼状的手脚是其特征",
        "描述": "两栖: 你天生能够在水下呼吸和移动。\n长舌: 你可以使用你的长舌抓住近距离范围内的物体。**标记 1 压力点**，将你的舌头用作一把使用你的熟练值造成 **d12** 物理伤害的灵巧近战武器。"
    },
    {
        "名称": "猿族",
        "类型": "种族",
        "简介": "猿族形似长着长肢和能抓握的脚的拟人化猴子和猿类",
        "描述": "天生攀爬者: 你在涉及平衡和攀爬的敏捷掷骰中具有优势。\n灵活: 在创建角色时，闪避值获得永久 +1 加值。"
    }
];