const ARMOR = [
    {
        "名称": "填充布甲",
        "重伤阈值": "5",
        "严重阈值": "11",
        "护甲值": "3",
        "特性": "**灵活：**闪避值+1。",
        "位阶": 1
    },
    {
        "名称": "皮甲",
        "重伤阈值": "6",
        "严重阈值": "13",
        "护甲值": "3",
        "特性": "",
        "位阶": 1
    },
    {
        "名称": "链甲",
        "重伤阈值": "7",
        "严重阈值": "15",
        "护甲值": "4",
        "特性": "**重型：**闪避值-1。",
        "位阶": 1
    },
    {
        "名称": "全板甲",
        "重伤阈值": "8",
        "严重阈值": "17",
        "护甲值": "4",
        "特性": "**极重：**闪避值-2，敏捷-1。",
        "位阶": 1
    },
    {
        "名称": "改良填充布甲",
        "重伤阈值": "7",
        "严重阈值": "16",
        "护甲值": "4",
        "特性": "**灵活：**闪避值+1。",
        "位阶": 2
    },
    {
        "名称": "改良皮甲",
        "重伤阈值": "9",
        "严重阈值": "20",
        "护甲值": "4",
        "特性": "",
        "位阶": 2
    },
    {
        "名称": "改良链甲",
        "重伤阈值": "11",
        "严重阈值": "24",
        "护甲值": "5",
        "特性": "**重型：**闪避值-1。",
        "位阶": 2
    },
    {
        "名称": "改良全板甲",
        "重伤阈值": "13",
        "严重阈值": "28",
        "护甲值": "5",
        "特性": "**极重：**闪避值-2，敏捷-1。",
        "位阶": 2
    },
    {
        "名称": "埃伦德里安链甲",
        "重伤阈值": "9",
        "严重阈值": "21",
        "护甲值": "4",
        "特性": "**防护：**受魔法伤害时，在计算伤害阈值前按护甲值减免伤害。",
        "位阶": 2
    },
    {
        "名称": "掠骸护甲",
        "重伤阈值": "9",
        "严重阈值": "21",
        "护甲值": "4",
        "特性": "**坚韧：**在标记最后一个护甲槽之前，掷一个d6。如果掷出6，则可以降低伤害一个等级而无需标记槽位。",
        "位阶": 2
    },
    {
        "名称": "铁木胸甲",
        "重伤阈值": "9",
        "严重阈值": "20",
        "护甲值": "4",
        "特性": "**强化：**当你标记最后一个护甲槽时，你的伤害阈值提升+2，直至你清除至少1个护甲槽。",
        "位阶": 2
    },
    {
        "名称": "符文浮甲",
        "重伤阈值": "9",
        "严重阈值": "20",
        "护甲值": "4",
        "特性": "**转移：**当你成为攻击目标时，可以**标记 1 护甲槽**，使针对你的攻击检定具有劣势。",
        "位阶": 2
    },
    {
        "名称": "泰瑞斯软甲",
        "重伤阈值": "8",
        "严重阈值": "18",
        "护甲值": "5",
        "特性": "**安静：**任何试图不被人听到的移动动作掷骰+2。",
        "位阶": 2
    },
    {
        "名称": "蔷薇野甲",
        "重伤阈值": "11",
        "严重阈值": "23",
        "护甲值": "5",
        "特性": "**希冀：**每当你需要**花费希望点**时，可以改为**标记护甲槽**。",
        "位阶": 2
    },
    {
        "名称": "高级填充布甲",
        "重伤阈值": "9",
        "严重阈值": "23",
        "护甲值": "5",
        "特性": "**灵活：**闪避值+1。",
        "位阶": 3
    },
    {
        "名称": "高级皮甲",
        "重伤阈值": "11",
        "严重阈值": "27",
        "护甲值": "5",
        "特性": "",
        "位阶": 3
    },
    {
        "名称": "高级链甲",
        "重伤阈值": "13",
        "严重阈值": "31",
        "护甲值": "6",
        "特性": "**重型：**闪避值-1。",
        "位阶": 3
    },
    {
        "名称": "高级全板甲",
        "重伤阈值": "15",
        "严重阈值": "35",
        "护甲值": "6",
        "特性": "**极重：**闪避值-2，敏捷-1。",
        "位阶": 3
    },
    {
        "名称": "贝拉莫伊精致护甲",
        "重伤阈值": "11",
        "严重阈值": "27",
        "护甲值": "5",
        "特性": "**鎏金：**风度+1。",
        "位阶": 3
    },
    {
        "名称": "龙鳞护甲",
        "重伤阈值": "11",
        "严重阈值": "27",
        "护甲值": "5",
        "特性": "**坚不可摧：**每短休一次，当你的生命值即将归零时，可以改为**标记 1 压力点**。",
        "位阶": 3
    },
    {
        "名称": "尖刺护甲",
        "重伤阈值": "10",
        "严重阈值": "25",
        "护甲值": "5",
        "特性": "**锋利：**每当你成功进行近战攻击时，伤害骰加1d4。",
        "位阶": 3
    },
    {
        "名称": "剑刃护甲",
        "重伤阈值": "16",
        "严重阈值": "39",
        "护甲值": "6",
        "特性": "**物理防御：**你不能使用此护甲抵消魔法伤害。",
        "位阶": 3
    },
    {
        "名称": "莫奈特的斗篷",
        "重伤阈值": "16",
        "严重阈值": "39",
        "护甲值": "6",
        "特性": "**魔法防御：**你不能使用此护甲抵消物理伤害。",
        "位阶": 3
    },
    {
        "名称": "强化符文",
        "重伤阈值": "17",
        "严重阈值": "43",
        "护甲值": "6",
        "特性": "**苦痛：**每当你因受到攻击而标记1点或更多的护甲槽时，需**标记 1 压力点**。",
        "位阶": 3
    },
    {
        "名称": "传奇填充布甲",
        "重伤阈值": "11",
        "严重阈值": "32",
        "护甲值": "6",
        "特性": "**灵活：**闪避值+1。",
        "位阶": 4
    },
    {
        "名称": "传奇皮甲",
        "重伤阈值": "13",
        "严重阈值": "36",
        "护甲值": "6",
        "特性": "",
        "位阶": 4
    },
    {
        "名称": "传奇链甲",
        "重伤阈值": "15",
        "严重阈值": "40",
        "护甲值": "7",
        "特性": "**重型：**闪避值-1。",
        "位阶": 4
    },
    {
        "名称": "传奇全板甲",
        "重伤阈值": "17",
        "严重阈值": "44",
        "护甲值": "7",
        "特性": "**极重：**闪避值-2，敏捷-1。",
        "位阶": 4
    },
    {
        "名称": "威能丝甲",
        "重伤阈值": "13",
        "严重阈值": "36",
        "护甲值": "7",
        "特性": "**时缓：****标记 1 护甲槽**，掷一个d4，并将结果作为闪避加值应用于对抗此次来袭攻击。",
        "位阶": 4
    },
    {
        "名称": "引导护甲",
        "重伤阈值": "13",
        "严重阈值": "36",
        "护甲值": "5",
        "特性": "**引导：**当装备此护甲时，所有施法掷骰+1",
        "位阶": 4
    },
    {
        "名称": "织烬护甲",
        "重伤阈值": "13",
        "严重阈值": "36",
        "护甲值": "6",
        "特性": "**燃烧：**每当有敌人在近战范围内击中你时，其立即**标记 1 压力点**。",
        "位阶": 4
    },
    {
        "名称": "全面强化护甲",
        "重伤阈值": "15",
        "严重阈值": "40",
        "护甲值": "4",
        "特性": "**坚毅：**当你**标记 1 护甲槽**时，可将攻击的严重程度降低两级而非一级。",
        "位阶": 4
    },
    {
        "名称": "诚实蛋白石护甲",
        "重伤阈值": "13",
        "严重阈值": "36",
        "护甲值": "6",
        "特性": "**求真：**当任何人在近距离范围内说谎时，此护甲将会发光。",
        "位阶": 4
    },
    {
        "名称": "救世主链甲",
        "重伤阈值": "18",
        "严重阈值": "48",
        "护甲值": "8",
        "特性": "**困难：**装备角色所有属性以及闪避值-1。",
        "位阶": 4
    }
];