const PRIMARY_WEAPON = [
    {
        "名称": "阔剑",
        "属性": "敏捷",
        "距离": "近战",
        "伤害": "d8",
        "双手": "单手",
        "类型": "物理",
        "特性": "**可靠：**你的攻击掷骰+1。",
        "位阶": 1
    },
    {
        "名称": "长剑",
        "属性": "敏捷",
        "距离": "近战",
        "伤害": "d8+3",
        "双手": "双手",
        "类型": "物理",
        "特性": "",
        "位阶": 1
    },
    {
        "名称": "战斧",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d10+3",
        "双手": "双手",
        "类型": "物理",
        "特性": "",
        "位阶": 1
    },
    {
        "名称": "巨剑",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d10+3",
        "双手": "双手",
        "类型": "物理",
        "特性": "**巨型：**闪避值-1，额外掷一个伤害骰并去掉其中最小的一个。",
        "位阶": 1
    },
    {
        "名称": "钉头锤",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d8+1",
        "双手": "单手",
        "类型": "物理",
        "特性": "",
        "位阶": 1
    },
    {
        "名称": "战锤",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d12+3",
        "双手": "双手",
        "类型": "物理",
        "特性": "**重型：**闪避值-1。",
        "位阶": 1
    },
    {
        "名称": "匕首",
        "属性": "灵巧",
        "距离": "近战",
        "伤害": "d8+1",
        "双手": "单手",
        "类型": "物理",
        "特性": "",
        "位阶": 1
    },
    {
        "名称": "短棍",
        "属性": "本能",
        "距离": "近战",
        "伤害": "d10+3",
        "双手": "双手",
        "类型": "物理",
        "特性": "",
        "位阶": 1
    },
    {
        "名称": "短刀",
        "属性": "风度",
        "距离": "近战",
        "伤害": "d8+1",
        "双手": "单手",
        "类型": "物理",
        "特性": "",
        "位阶": 1
    },
    {
        "名称": "刺剑",
        "属性": "风度",
        "距离": "近战",
        "伤害": "d8",
        "双手": "单手",
        "类型": "物理",
        "特性": "**迅捷：****标记 1 压力点**以额外攻击一个范围内的目标。",
        "位阶": 1
    },
    {
        "名称": "戟",
        "属性": "力量",
        "距离": "邻近",
        "伤害": "d10+2",
        "双手": "双手",
        "类型": "物理",
        "特性": "**繁琐：**灵巧-1。",
        "位阶": 1
    },
    {
        "名称": "长矛",
        "属性": "灵巧",
        "距离": "邻近",
        "伤害": "d10+2",
        "双手": "双手",
        "类型": "物理",
        "特性": "**繁琐：**灵巧-1。",
        "位阶": 1
    },
    {
        "名称": "短弓",
        "属性": "敏捷",
        "距离": "远距离",
        "伤害": "d6+3",
        "双手": "双手",
        "类型": "物理",
        "特性": "",
        "位阶": 1
    },
    {
        "名称": "弩",
        "属性": "灵巧",
        "距离": "远距离",
        "伤害": "d6+1",
        "双手": "单手",
        "类型": "物理",
        "特性": "",
        "位阶": 1
    },
    {
        "名称": "长弓",
        "属性": "敏捷",
        "距离": "极远",
        "伤害": "d8+3",
        "双手": "双手",
        "类型": "物理",
        "特性": "**繁琐：**灵巧-1。",
        "位阶": 1
    },
    {
        "名称": "奥术护手",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d10+3",
        "双手": "双手",
        "类型": "魔法",
        "特性": "",
        "位阶": 1
    },
    {
        "名称": "圣斧",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d8+1",
        "双手": "单手",
        "类型": "魔法",
        "特性": "",
        "位阶": 1
    },
    {
        "名称": "发光戒指",
        "属性": "敏捷",
        "距离": "邻近",
        "伤害": "d10+1",
        "双手": "双手",
        "类型": "魔法",
        "特性": "",
        "位阶": 1
    },
    {
        "名称": "手持符文",
        "属性": "本能",
        "距离": "邻近",
        "伤害": "d10",
        "双手": "单手",
        "类型": "魔法",
        "特性": "",
        "位阶": 1
    },
    {
        "名称": "回力剑",
        "属性": "灵巧",
        "距离": "近距离",
        "伤害": "d8",
        "双手": "单手",
        "类型": "魔法",
        "特性": "**回力：**当此武器在射程内被投掷后，会在完成攻击的瞬间重新出现在你手中。",
        "位阶": 1
    },
    {
        "名称": "短杖",
        "属性": "本能",
        "距离": "近距离",
        "伤害": "d8+1",
        "双手": "单手",
        "类型": "魔法",
        "特性": "",
        "位阶": 1
    },
    {
        "名称": "双手法杖",
        "属性": "本能",
        "距离": "远距离",
        "伤害": "d6+3",
        "双手": "双手",
        "类型": "魔法",
        "特性": "",
        "位阶": 1
    },
    {
        "名称": "权杖",
        "属性": "风度",
        "距离": "远距离",
        "伤害": "d6",
        "双手": "双手",
        "类型": "魔法",
        "特性": "**多用：**这把武器也可以此方式使用 - 风度 近战 d8。",
        "位阶": 1
    },
    {
        "名称": "魔杖",
        "属性": "知识",
        "距离": "远距离",
        "伤害": "d6+1",
        "双手": "单手",
        "类型": "魔法",
        "特性": "",
        "位阶": 1
    },
    {
        "名称": "巨杖",
        "属性": "知识",
        "距离": "极远",
        "伤害": "d6",
        "双手": "双手",
        "类型": "魔法",
        "特性": "**强力：**额外掷一个伤害骰并去掉其中最小的一个。",
        "位阶": 1
    },
    {
        "名称": "改良阔剑",
        "属性": "敏捷",
        "距离": "近战",
        "伤害": "d8+3",
        "双手": "单手",
        "类型": "物理",
        "特性": "**可靠：**你的攻击掷骰+1。",
        "位阶": 2
    },
    {
        "名称": "改良长剑",
        "属性": "敏捷",
        "距离": "近战",
        "伤害": "d8+6",
        "双手": "双手",
        "类型": "物理",
        "特性": "",
        "位阶": 2
    },
    {
        "名称": "改良战斧",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d10+6",
        "双手": "双手",
        "类型": "物理",
        "特性": "",
        "位阶": 2
    },
    {
        "名称": "改良巨剑",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d10+6",
        "双手": "双手",
        "类型": "物理",
        "特性": "**巨型：**闪避值-1，额外掷一个伤害骰并去掉其中最小的一个。",
        "位阶": 2
    },
    {
        "名称": "改良钉头锤",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d8+4",
        "双手": "单手",
        "类型": "物理",
        "特性": "",
        "位阶": 2
    },
    {
        "名称": "改良战锤",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d12+6",
        "双手": "双手",
        "类型": "物理",
        "特性": "**重型：**闪避值-1。",
        "位阶": 2
    },
    {
        "名称": "改良匕首",
        "属性": "灵巧",
        "距离": "近战",
        "伤害": "d8+4",
        "双手": "单手",
        "类型": "物理",
        "特性": "",
        "位阶": 2
    },
    {
        "名称": "改良短棍",
        "属性": "本能",
        "距离": "近战",
        "伤害": "d10+6",
        "双手": "双手",
        "类型": "物理",
        "特性": "",
        "位阶": 2
    },
    {
        "名称": "改良短刀",
        "属性": "风度",
        "距离": "近战",
        "伤害": "d8+4",
        "双手": "单手",
        "类型": "物理",
        "特性": "",
        "位阶": 2
    },
    {
        "名称": "改良刺剑",
        "属性": "风度",
        "距离": "近战",
        "伤害": "d8+3",
        "双手": "单手",
        "类型": "物理",
        "特性": "**迅捷：****标记 1 压力点**以额外攻击一个范围内的目标。",
        "位阶": 2
    },
    {
        "名称": "改良戟",
        "属性": "力量",
        "距离": "邻近",
        "伤害": "d10+5",
        "双手": "双手",
        "类型": "物理",
        "特性": "**繁琐：**灵巧-1。",
        "位阶": 2
    },
    {
        "名称": "改良长矛",
        "属性": "灵巧",
        "距离": "邻近",
        "伤害": "d10+5",
        "双手": "双手",
        "类型": "物理",
        "特性": "**繁琐：**灵巧-1。",
        "位阶": 2
    },
    {
        "名称": "改良短弓",
        "属性": "敏捷",
        "距离": "远距离",
        "伤害": "d6+6",
        "双手": "双手",
        "类型": "物理",
        "特性": "",
        "位阶": 2
    },
    {
        "名称": "改良弩",
        "属性": "灵巧",
        "距离": "远距离",
        "伤害": "d6+4",
        "双手": "单手",
        "类型": "物理",
        "特性": "",
        "位阶": 2
    },
    {
        "名称": "改良长弓",
        "属性": "敏捷",
        "距离": "极远",
        "伤害": "d8+6",
        "双手": "双手",
        "类型": "物理",
        "特性": "**繁琐：**灵巧-1。",
        "位阶": 2
    },
    {
        "名称": "鎏金弯刀",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d10+4",
        "双手": "单手",
        "类型": "物理",
        "特性": "**强力：**额外掷一个伤害骰并去掉其中最小的一个。",
        "位阶": 2
    },
    {
        "名称": "拳刃",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d10+6",
        "双手": "双手",
        "类型": "物理",
        "特性": "**残暴：**伤害骰每掷出一次最大值，就额外掷出一个伤害骰。",
        "位阶": 2
    },
    {
        "名称": "乌洛克阔剑",
        "属性": "灵巧",
        "距离": "近战",
        "伤害": "d8+3",
        "双手": "单手",
        "类型": "物理",
        "特性": "**致命：**造成严重伤害时，额外造成 1 生命点的伤害。",
        "位阶": 2
    },
    {
        "名称": "刃鞭",
        "属性": "敏捷",
        "距离": "邻近",
        "伤害": "d8+3",
        "双手": "单手",
        "类型": "物理",
        "特性": "**迅捷：****标记 1 压力点**以额外攻击一个范围内的目标 。",
        "位阶": 2
    },
    {
        "名称": "钢铸戟",
        "属性": "力量",
        "距离": "邻近",
        "伤害": "d8+4",
        "双手": "双手",
        "类型": "物理",
        "特性": "**恐惧：**成功的攻击同时会额外**标记 1 压力点**。",
        "位阶": 2
    },
    {
        "名称": "战镰",
        "属性": "灵巧",
        "距离": "邻近",
        "伤害": "d8+5",
        "双手": "双手",
        "类型": "物理",
        "特性": "**可靠：**你的攻击掷骰+1。",
        "位阶": 2
    },
    {
        "名称": "火铳",
        "属性": "灵巧",
        "距离": "近距离",
        "伤害": "d8+6",
        "双手": "双手",
        "类型": "物理",
        "特性": "**装填：**攻击后掷一个d6，掷出1时，下次攻击前你必须**标记 1 压力点**进行装填。",
        "位阶": 2
    },
    {
        "名称": "巨弓",
        "属性": "力量",
        "距离": "远距离",
        "伤害": "d6+6",
        "双手": "双手",
        "类型": "物理",
        "特性": "**强力：**额外掷一个伤害骰并去掉其中最小的一个。",
        "位阶": 2
    },
    {
        "名称": "细弦弓",
        "属性": "敏捷",
        "距离": "极远",
        "伤害": "d6+5",
        "双手": "双手",
        "类型": "物理",
        "特性": "**可靠：**你的攻击掷骰+1。",
        "位阶": 2
    },
    {
        "名称": "改良奥术护手",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d10+6",
        "双手": "双手",
        "类型": "魔法",
        "特性": "",
        "位阶": 2
    },
    {
        "名称": "改良圣斧",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d8+4",
        "双手": "单手",
        "类型": "魔法",
        "特性": "",
        "位阶": 2
    },
    {
        "名称": "改良发光戒指",
        "属性": "敏捷",
        "距离": "邻近",
        "伤害": "d10+5",
        "双手": "双手",
        "类型": "魔法",
        "特性": "",
        "位阶": 2
    },
    {
        "名称": "改良手持符文",
        "属性": "本能",
        "距离": "邻近",
        "伤害": "d10+3",
        "双手": "单手",
        "类型": "魔法",
        "特性": "",
        "位阶": 2
    },
    {
        "名称": "改良回力剑",
        "属性": "灵巧",
        "距离": "近距离",
        "伤害": "d8+3",
        "双手": "单手",
        "类型": "魔法",
        "特性": "**回力：**当此武器在射程内被投掷后，会在完成攻击的瞬间重新出现在你手中。",
        "位阶": 2
    },
    {
        "名称": "改良短杖",
        "属性": "本能",
        "距离": "近距离",
        "伤害": "d8+4",
        "双手": "单手",
        "类型": "魔法",
        "特性": "",
        "位阶": 2
    },
    {
        "名称": "改良双手法杖",
        "属性": "本能",
        "距离": "远距离",
        "伤害": "d6+6",
        "双手": "双手",
        "类型": "魔法",
        "特性": "",
        "位阶": 2
    },
    {
        "名称": "改良权杖",
        "属性": "风度",
        "距离": "远距离",
        "伤害": "d6+3",
        "双手": "双手",
        "类型": "魔法",
        "特性": "**多用：**这把武器也可以此方式使用 - 风度 近战 d8+3。",
        "位阶": 2
    },
    {
        "名称": "改良魔杖",
        "属性": "知识",
        "距离": "远距离",
        "伤害": "d6+4",
        "双手": "单手",
        "类型": "魔法",
        "特性": "",
        "位阶": 2
    },
    {
        "名称": "改良巨杖",
        "属性": "知识",
        "距离": "极远",
        "伤害": "d6+3",
        "双手": "双手",
        "类型": "魔法",
        "特性": "**强力：**额外掷一个伤害骰并去掉其中最小的一个。",
        "位阶": 2
    },
    {
        "名称": "自我之刃",
        "属性": "敏捷",
        "距离": "近战",
        "伤害": "d12+4",
        "双手": "单手",
        "类型": "魔法",
        "特性": "**傲慢：**0或者更低的风度才可以使用该武器。",
        "位阶": 2
    },
    {
        "名称": "施法剑",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d10+4",
        "双手": "双手",
        "类型": "魔法",
        "特性": "**多用：**这把武器也可以此方式使用 - 知识 远距离 d6+3。",
        "位阶": 2
    },
    {
        "名称": "吞噬匕首",
        "属性": "灵巧",
        "距离": "近战",
        "伤害": "d8+4",
        "双手": "单手",
        "类型": "魔法",
        "特性": "**恐惧：**成功攻击的同时会额外**标记 1 压力点**。",
        "位阶": 2
    },
    {
        "名称": "异界之锤",
        "属性": "本能",
        "距离": "近战",
        "伤害": "d8+6",
        "双手": "双手",
        "类型": "魔法",
        "特性": "**爆发：**当你在近战中击中一个生物时，每个邻近的敌人都必须进行反应掷骰（14），否则也会受到一半的伤害。",
        "位阶": 2
    },
    {
        "名称": "尤塔里血弓",
        "属性": "灵巧",
        "距离": "远距离",
        "伤害": "d6+4",
        "双手": "双手",
        "类型": "魔法",
        "特性": "**残暴：**伤害骰每掷出一次最大值，就额外掷出一个伤害骰。",
        "位阶": 2
    },
    {
        "名称": "长者之弓",
        "属性": "本能",
        "距离": "远距离",
        "伤害": "d6+4",
        "双手": "双手",
        "类型": "魔法",
        "特性": "**强力：**额外掷一个伤害骰并去掉其中最小的一个。",
        "位阶": 2
    },
    {
        "名称": "伊利亚斯的权杖",
        "属性": "风度",
        "距离": "远距离",
        "伤害": "d6+3",
        "双手": "单手",
        "类型": "魔法",
        "特性": "**振奋：**当你成功攻击时，掷一个 d4。掷出 4 时，**清除 1 压力点** 。",
        "位阶": 2
    },
    {
        "名称": "迷惑魔杖",
        "属性": "风度",
        "距离": "远距离",
        "伤害": "d6+4",
        "双手": "单手",
        "类型": "魔法",
        "特性": "**说服：**在进行风度掷骰前可**标记 1 压力点**以获得+2加值。",
        "位阶": 2
    },
    {
        "名称": "看守者之杖",
        "属性": "知识",
        "距离": "远距离",
        "伤害": "d6+4",
        "双手": "双手",
        "类型": "魔法",
        "特性": "**可靠：**你的攻击掷骰+1。",
        "位阶": 2
    },
    {
        "名称": "高级阔剑",
        "属性": "敏捷",
        "距离": "近战",
        "伤害": "d8+6",
        "双手": "单手",
        "类型": "物理",
        "特性": "**可靠：**你的攻击掷骰+1。",
        "位阶": 3
    },
    {
        "名称": "高级长剑",
        "属性": "敏捷",
        "距离": "近战",
        "伤害": "d8+9",
        "双手": "双手",
        "类型": "物理",
        "特性": "",
        "位阶": 3
    },
    {
        "名称": "高级战斧",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d10+9",
        "双手": "双手",
        "类型": "物理",
        "特性": "",
        "位阶": 3
    },
    {
        "名称": "高级巨剑",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d10+9",
        "双手": "双手",
        "类型": "物理",
        "特性": "**巨型：**闪避值-1，额外掷一个伤害骰并去掉其中最小的一个。",
        "位阶": 3
    },
    {
        "名称": "高级钉头锤",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d8+7",
        "双手": "单手",
        "类型": "物理",
        "特性": "",
        "位阶": 3
    },
    {
        "名称": "高级战锤",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d12+9",
        "双手": "双手",
        "类型": "物理",
        "特性": "**重型：**闪避值-1。",
        "位阶": 3
    },
    {
        "名称": "高级匕首",
        "属性": "灵巧",
        "距离": "近战",
        "伤害": "d8+7",
        "双手": "单手",
        "类型": "物理",
        "特性": "",
        "位阶": 3
    },
    {
        "名称": "高级短棍",
        "属性": "本能",
        "距离": "近战",
        "伤害": "d10+9",
        "双手": "双手",
        "类型": "物理",
        "特性": "",
        "位阶": 3
    },
    {
        "名称": "高级短刀",
        "属性": "风度",
        "距离": "近战",
        "伤害": "d8+7",
        "双手": "单手",
        "类型": "物理",
        "特性": "",
        "位阶": 3
    },
    {
        "名称": "高级刺剑",
        "属性": "风度",
        "距离": "近战",
        "伤害": "d8+6",
        "双手": "单手",
        "类型": "物理",
        "特性": "**迅捷：****标记 1 压力点**以额外攻击一个范围内的目标。",
        "位阶": 3
    },
    {
        "名称": "高级戟",
        "属性": "力量",
        "距离": "邻近",
        "伤害": "d10+8",
        "双手": "双手",
        "类型": "物理",
        "特性": "**繁琐：**灵巧-1。",
        "位阶": 3
    },
    {
        "名称": "高级长矛",
        "属性": "灵巧",
        "距离": "邻近",
        "伤害": "d10+8",
        "双手": "双手",
        "类型": "物理",
        "特性": "**繁琐：**灵巧-1。",
        "位阶": 3
    },
    {
        "名称": "高级短弓",
        "属性": "敏捷",
        "距离": "远距离",
        "伤害": "d6+9",
        "双手": "双手",
        "类型": "物理",
        "特性": "",
        "位阶": 3
    },
    {
        "名称": "高级弩",
        "属性": "灵巧",
        "距离": "远距离",
        "伤害": "d6+7",
        "双手": "单手",
        "类型": "物理",
        "特性": "",
        "位阶": 3
    },
    {
        "名称": "高级长弓",
        "属性": "敏捷",
        "距离": "极远",
        "伤害": "d8+9",
        "双手": "双手",
        "类型": "物理",
        "特性": "**繁琐：**灵巧-1。",
        "位阶": 3
    },
    {
        "名称": "闪蝶之刃",
        "属性": "敏捷",
        "距离": "近战",
        "伤害": "d8+5",
        "双手": "单手",
        "类型": "物理",
        "特性": "**锐翼：**将你的敏捷属性值加入该武器的伤害掷骰加值中。",
        "位阶": 3
    },
    {
        "名称": "勇气之剑",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d12+7",
        "双手": "双手",
        "类型": "物理",
        "特性": "**勇气：**闪避值 -1 ，严重伤害阈值 +3 。",
        "位阶": 3
    },
    {
        "名称": "愤怒之锤",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d10+7",
        "双手": "双手",
        "类型": "物理",
        "特性": "**毁灭：**在攻击掷骰之前**标记 1 压力点**，在进行伤害掷骰时，把你的伤害骰改为d20",
        "位阶": 3
    },
    {
        "名称": "拉布里斯斧",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d10+7",
        "双手": "双手",
        "类型": "物理",
        "特性": "**保护：**护甲值+1。",
        "位阶": 3
    },
    {
        "名称": "经络短刀",
        "属性": "风度",
        "距离": "近战",
        "伤害": "d10+5",
        "双手": "单手",
        "类型": "物理",
        "特性": "**决斗：**当近距离内除了当前目标外没有其他生物时，攻击掷骰时获得优势。",
        "位阶": 3
    },
    {
        "名称": "伸缩军刀",
        "属性": "风度",
        "距离": "近战",
        "伤害": "d10+7",
        "双手": "单手",
        "类型": "物理",
        "特性": "**伸缩：**刀片可以隐藏在刀柄中以避免被识别为武器。",
        "位阶": 3
    },
    {
        "名称": "双连枷",
        "属性": "敏捷",
        "距离": "邻近",
        "伤害": "d10+8",
        "双手": "双手",
        "类型": "物理",
        "特性": "**强力：**额外掷一个伤害骰并去掉其中最小的一个。",
        "位阶": 3
    },
    {
        "名称": "利爪之刃",
        "属性": "灵巧",
        "距离": "近距离",
        "伤害": "d10+7",
        "双手": "双手",
        "类型": "物理",
        "特性": "**残暴：**伤害骰每掷出一次最大值，就额外掷出一个伤害骰。",
        "位阶": 3
    },
    {
        "名称": "黑火药左轮",
        "属性": "灵巧",
        "距离": "远距离",
        "伤害": "d6+8",
        "双手": "单手",
        "类型": "物理",
        "特性": "**装填：**攻击后掷一个d6，掷出1时，下次攻击前你必须**标记 1 压力点**进行装填",
        "位阶": 3
    },
    {
        "名称": "尖刺弓",
        "属性": "敏捷",
        "距离": "极远",
        "伤害": "d6+7",
        "双手": "双手",
        "类型": "物理",
        "特性": "**多用：**这把武器也可以此方式使用 - 敏捷 近战 d10+5。",
        "位阶": 3
    },
    {
        "名称": "高级奥术护手",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d10+9",
        "双手": "双手",
        "类型": "魔法",
        "特性": "",
        "位阶": 3
    },
    {
        "名称": "高级圣斧",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d8+7",
        "双手": "单手",
        "类型": "魔法",
        "特性": "",
        "位阶": 3
    },
    {
        "名称": "高级发光戒指",
        "属性": "敏捷",
        "距离": "邻近",
        "伤害": "d10+8",
        "双手": "双手",
        "类型": "魔法",
        "特性": "",
        "位阶": 3
    },
    {
        "名称": "高级手持符文",
        "属性": "本能",
        "距离": "邻近",
        "伤害": "d10+6",
        "双手": "单手",
        "类型": "魔法",
        "特性": "",
        "位阶": 3
    },
    {
        "名称": "高级回力剑",
        "属性": "灵巧",
        "距离": "近距离",
        "伤害": "d8+6",
        "双手": "单手",
        "类型": "魔法",
        "特性": "**回力：**当此武器在射程内被投掷后，会在完成攻击的瞬间重新出现在你手中。",
        "位阶": 3
    },
    {
        "名称": "高级短杖",
        "属性": "本能",
        "距离": "近距离",
        "伤害": "d8+7",
        "双手": "单手",
        "类型": "魔法",
        "特性": "",
        "位阶": 3
    },
    {
        "名称": "高级双手法杖",
        "属性": "本能",
        "距离": "远距离",
        "伤害": "d6+9",
        "双手": "双手",
        "类型": "魔法",
        "特性": "",
        "位阶": 3
    },
    {
        "名称": "高级权杖",
        "属性": "风度",
        "距离": "远距离",
        "伤害": "d6+6",
        "双手": "双手",
        "类型": "魔法",
        "特性": "**多用：**这把武器也可以此方式使用 - 本能 近战 d8+4。",
        "位阶": 3
    },
    {
        "名称": "高级魔杖",
        "属性": "知识",
        "距离": "远距离",
        "伤害": "d6+7",
        "双手": "单手",
        "类型": "魔法",
        "特性": "",
        "位阶": 3
    },
    {
        "名称": "高级巨杖",
        "属性": "知识",
        "距离": "极远",
        "伤害": "d6+6",
        "双手": "双手",
        "类型": "魔法",
        "特性": "**强力：**额外掷一个伤害骰并去掉其中最小的一个。",
        "位阶": 3
    },
    {
        "名称": "运气之斧",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d10+8",
        "双手": "双手",
        "类型": "魔法",
        "特性": "**幸运：****花费 1 压力点**重骰一次失败的掷骰，并接受新的结果。",
        "位阶": 3
    },
    {
        "名称": "祝福匕首",
        "属性": "本能",
        "距离": "近战",
        "伤害": "d10+6",
        "双手": "单手",
        "类型": "魔法",
        "特性": "**治愈：**休息时间时，自动**恢复 1 生命点**",
        "位阶": 3
    },
    {
        "名称": "鬼魂之刃",
        "属性": "风度",
        "距离": "近战",
        "伤害": "d10+7",
        "双手": "单手",
        "类型": "魔法",
        "特性": "**异界：**你可以选择造成物理或者魔法伤害。",
        "位阶": 3
    },
    {
        "名称": "毁灭符文",
        "属性": "知识",
        "距离": "邻近",
        "伤害": "d20+4",
        "双手": "单手",
        "类型": "魔法",
        "特性": "**苦痛：**每次你使用此武器成功攻击时，你需**标记 1 压力点**。",
        "位阶": 3
    },
    {
        "名称": "维多加斯特的吊坠",
        "属性": "知识",
        "距离": "近距离",
        "伤害": "d10+5",
        "双手": "单手",
        "类型": "魔法",
        "特性": "**时间扭曲者：**你可以在攻击掷骰后选择攻击目标。",
        "位阶": 3
    },
    {
        "名称": "鎏金弓",
        "属性": "灵巧",
        "距离": "远距离",
        "伤害": "d6+7",
        "双手": "双手",
        "类型": "魔法",
        "特性": "**自省：**伤害掷骰中的所有1都视为6。",
        "位阶": 3
    },
    {
        "名称": "火焰杖",
        "属性": "本能",
        "距离": "远距离",
        "伤害": "d6+7",
        "双手": "双手",
        "类型": "魔法",
        "特性": "**灼烧：**伤害掷骰中掷出的每个6都使目标**标记 1 压力点**。",
        "位阶": 3
    },
    {
        "名称": "法师球",
        "属性": "知识",
        "距离": "远距离",
        "伤害": "d6+7",
        "双手": "单手",
        "类型": "魔法",
        "特性": "**强力：**额外掷一个伤害骰并去掉其中最小的一个。",
        "位阶": 3
    },
    {
        "名称": "伊尔玛里的步枪",
        "属性": "灵巧",
        "距离": "极远",
        "伤害": "d6+6",
        "双手": "单手",
        "类型": "魔法",
        "特性": "**装填：**攻击后掷一个d6，掷出1时，下次攻击前你必须**标记 1 压力点**进行装填。",
        "位阶": 3
    },
    {
        "名称": "传奇阔剑",
        "属性": "敏捷",
        "距离": "近战",
        "伤害": "d8+9",
        "双手": "单手",
        "类型": "物理",
        "特性": "**可靠：**你的攻击掷骰+1。",
        "位阶": 4
    },
    {
        "名称": "传奇长剑",
        "属性": "敏捷",
        "距离": "近战",
        "伤害": "d8+12",
        "双手": "双手",
        "类型": "物理",
        "特性": "",
        "位阶": 4
    },
    {
        "名称": "传奇战斧",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d10+12",
        "双手": "双手",
        "类型": "物理",
        "特性": "",
        "位阶": 4
    },
    {
        "名称": "传奇巨剑",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d10+12",
        "双手": "双手",
        "类型": "物理",
        "特性": "**巨型：**闪避值-1，额外掷一个伤害骰并去掉其中最小的一个。",
        "位阶": 4
    },
    {
        "名称": "传奇钉头锤",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d8+10",
        "双手": "单手",
        "类型": "物理",
        "特性": "",
        "位阶": 4
    },
    {
        "名称": "传奇战锤",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d12+12",
        "双手": "双手",
        "类型": "物理",
        "特性": "**重型：**闪避值-1。",
        "位阶": 4
    },
    {
        "名称": "传奇匕首",
        "属性": "灵巧",
        "距离": "近战",
        "伤害": "d8+10",
        "双手": "单手",
        "类型": "物理",
        "特性": "",
        "位阶": 4
    },
    {
        "名称": "传奇短棍",
        "属性": "本能",
        "距离": "近战",
        "伤害": "d10+12",
        "双手": "双手",
        "类型": "物理",
        "特性": "",
        "位阶": 4
    },
    {
        "名称": "传奇短刀",
        "属性": "风度",
        "距离": "近战",
        "伤害": "d8+10",
        "双手": "单手",
        "类型": "物理",
        "特性": "",
        "位阶": 4
    },
    {
        "名称": "传奇刺剑",
        "属性": "风度",
        "距离": "近战",
        "伤害": "d8+9",
        "双手": "单手",
        "类型": "物理",
        "特性": "**迅捷：****标记 1 压力点**以额外攻击一个范围内的目标。",
        "位阶": 4
    },
    {
        "名称": "传奇戟",
        "属性": "力量",
        "距离": "邻近",
        "伤害": "d10+11",
        "双手": "双手",
        "类型": "物理",
        "特性": "**繁琐：**灵巧-1。",
        "位阶": 4
    },
    {
        "名称": "传奇长矛",
        "属性": "灵巧",
        "距离": "邻近",
        "伤害": "d10+11",
        "双手": "双手",
        "类型": "物理",
        "特性": "**繁琐：**灵巧-1。",
        "位阶": 4
    },
    {
        "名称": "传奇短弓",
        "属性": "敏捷",
        "距离": "远距离",
        "伤害": "d6+12",
        "双手": "双手",
        "类型": "物理",
        "特性": "",
        "位阶": 4
    },
    {
        "名称": "传奇弩",
        "属性": "灵巧",
        "距离": "远距离",
        "伤害": "d6+10",
        "双手": "单手",
        "类型": "物理",
        "特性": "",
        "位阶": 4
    },
    {
        "名称": "传奇长弓",
        "属性": "敏捷",
        "距离": "极远",
        "伤害": "d8+12",
        "双手": "双手",
        "类型": "物理",
        "特性": "**繁琐：**灵巧-1。",
        "位阶": 4
    },
    {
        "名称": "双刃剑",
        "属性": "敏捷",
        "距离": "近战",
        "伤害": "d10+9",
        "双手": "双手",
        "类型": "物理",
        "特性": "**迅捷：****标记 1 压力点**以额外攻击一个范围内的目标。",
        "位阶": 4
    },
    {
        "名称": "冲击拳套",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d10+11",
        "双手": "单手",
        "类型": "物理",
        "特性": "**震荡：**在一次成功攻击后**花费 1 希望点**，将目标击退至远距离。",
        "位阶": 4
    },
    {
        "名称": "巨斧",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d12+13",
        "双手": "双手",
        "类型": "物理",
        "特性": "**破坏：**敏捷-1，成功攻击后为所有邻近范围内的敌人**标记 1 压力点**。",
        "位阶": 4
    },
    {
        "名称": "弧形匕首",
        "属性": "灵巧",
        "距离": "近战",
        "伤害": "d8+9",
        "双手": "单手",
        "类型": "物理",
        "特性": "**锯齿：**伤害掷骰中的所有1都视为8。",
        "位阶": 4
    },
    {
        "名称": "延伸长柄武器",
        "属性": "灵巧",
        "距离": "邻近",
        "伤害": "d8+10",
        "双手": "双手",
        "类型": "物理",
        "特性": "**延长：**你能够将范围内所有处于一条直线上的敌人同时作为你的攻击目标。",
        "位阶": 4
    },
    {
        "名称": "摆动绳刃",
        "属性": "风度",
        "距离": "近距离",
        "伤害": "d8+9",
        "双手": "双手",
        "类型": "物理",
        "特性": "**捕获：**在一次成功攻击后**花费 1 希望点**，使目标处于束缚状态或者将其拉至你的近战范围。",
        "位阶": 4
    },
    {
        "名称": "弹跳斧",
        "属性": "敏捷",
        "距离": "远距离",
        "伤害": "d6+11",
        "双手": "双手",
        "类型": "物理",
        "特性": "**弹跳：**标记任意压力点，可同时攻击范围内等量的敌人。",
        "位阶": 4
    },
    {
        "名称": "安塔利弓",
        "属性": "灵巧",
        "距离": "远距离",
        "伤害": "d6+11",
        "双手": "双手",
        "类型": "物理",
        "特性": "**可靠：**你的攻击掷骰+1。",
        "位阶": 4
    },
    {
        "名称": "手炮",
        "属性": "灵巧",
        "距离": "极远",
        "伤害": "d6+12",
        "双手": "单手",
        "类型": "物理",
        "特性": "**装填：**攻击后掷一个d6，掷出1时，下次攻击前你必须**标记 1 压力点**进行装填。",
        "位阶": 4
    },
    {
        "名称": "传奇奥术护手",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d10+12",
        "双手": "双手",
        "类型": "魔法",
        "特性": "",
        "位阶": 4
    },
    {
        "名称": "传奇圣斧",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d8+10",
        "双手": "单手",
        "类型": "魔法",
        "特性": "",
        "位阶": 4
    },
    {
        "名称": "传奇发光戒指",
        "属性": "敏捷",
        "距离": "邻近",
        "伤害": "d10+11",
        "双手": "双手",
        "类型": "魔法",
        "特性": "",
        "位阶": 4
    },
    {
        "名称": "传奇手持符文",
        "属性": "本能",
        "距离": "邻近",
        "伤害": "d10+9",
        "双手": "单手",
        "类型": "魔法",
        "特性": "",
        "位阶": 4
    },
    {
        "名称": "传奇回力剑",
        "属性": "灵巧",
        "距离": "近距离",
        "伤害": "d8+9",
        "双手": "单手",
        "类型": "魔法",
        "特性": "**回力：**当此武器在射程内被投掷后，会在完成攻击的瞬间重新出现在你手中。",
        "位阶": 4
    },
    {
        "名称": "传奇短杖",
        "属性": "本能",
        "距离": "近距离",
        "伤害": "d8+10",
        "双手": "单手",
        "类型": "魔法",
        "特性": "",
        "位阶": 4
    },
    {
        "名称": "传奇双手法杖",
        "属性": "本能",
        "距离": "远距离",
        "伤害": "d8+12",
        "双手": "双手",
        "类型": "魔法",
        "特性": "",
        "位阶": 4
    },
    {
        "名称": "传奇权杖",
        "属性": "风度",
        "距离": "远距离",
        "伤害": "d6+9",
        "双手": "双手",
        "类型": "魔法",
        "特性": "**多用：**这把武器也可以此方式使用 - 本能 近战 d8+6。",
        "位阶": 4
    },
    {
        "名称": "传奇魔杖",
        "属性": "知识",
        "距离": "远距离",
        "伤害": "d6+10",
        "双手": "单手",
        "类型": "魔法",
        "特性": "",
        "位阶": 4
    },
    {
        "名称": "传奇巨杖",
        "属性": "知识",
        "距离": "极远",
        "伤害": "d6+9",
        "双手": "双手",
        "类型": "魔法",
        "特性": "**强力：**额外掷一个伤害骰并去掉其中最小的一个。",
        "位阶": 4
    },
    {
        "名称": "光焰剑",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d10+11",
        "双手": "双手",
        "类型": "魔法",
        "特性": "**烧融：**可以切开坚固的材质。",
        "位阶": 4
    },
    {
        "名称": "虹吸拳套",
        "属性": "风度",
        "距离": "近战",
        "伤害": "d10+9",
        "双手": "双手",
        "类型": "魔法",
        "特性": "**系命：**在一次成功攻击后掷一个6，如果掷出6则**恢复 1 生命点**或**清除 1 压力点**",
        "位阶": 4
    },
    {
        "名称": "迈达斯镰刀",
        "属性": "知识",
        "距离": "近战",
        "伤害": "d10+9",
        "双手": "双手",
        "类型": "魔法",
        "特性": "**贪婪：**你可以花费一把金币，使你的伤害掷骰熟练值+1。",
        "位阶": 4
    },
    {
        "名称": "漂浮碎刃",
        "属性": "本能",
        "距离": "近距离",
        "伤害": "d8+9",
        "双手": "单手",
        "类型": "魔法",
        "特性": "**强力：**额外掷一个伤害骰并去掉其中最小的一个。",
        "位阶": 4
    },
    {
        "名称": "血杖",
        "属性": "本能",
        "距离": "远距离",
        "伤害": "d20+7",
        "双手": "双手",
        "类型": "魔法",
        "特性": "**苦痛：**每次你使用此武器攻击时，你需**标记 1 压力点**。",
        "位阶": 4
    },
    {
        "名称": "蓟弓",
        "属性": "本能",
        "距离": "远距离",
        "伤害": "d6+13",
        "双手": "双手",
        "类型": "魔法",
        "特性": "**可靠：**你的攻击掷骰+1。",
        "位阶": 4
    },
    {
        "名称": "埃塞克之杖",
        "属性": "知识",
        "距离": "远距离",
        "伤害": "d8+13",
        "双手": "单手",
        "类型": "魔法",
        "特性": "**时间扭曲者：**你可以在攻击掷骰后选择攻击目标。",
        "位阶": 4
    },
    {
        "名称": "魔战士左轮",
        "属性": "灵巧",
        "距离": "极远",
        "伤害": "d6+13",
        "双手": "单手",
        "类型": "魔法",
        "特性": "**装填：**攻击后掷一个6，如果掷出1，下次攻击前你必须**标记 1 压力点**进行装填。",
        "位阶": 4
    },
    {
        "名称": "融合手套",
        "属性": "知识",
        "距离": "极远",
        "伤害": "d6+9",
        "双手": "双手",
        "类型": "魔法",
        "特性": "**绑定：**将你的等级数添加到伤害掷骰中。",
        "位阶": 4
    }
];