const CONSUMABLES_DATA = [
  {
    "roll": 1, 
    "名称": "神行药水", 
    "原名": "Stride Potion", 
    "效果": "下一次敏捷掷骰+1" 
  },
  {
    "roll": 2, 
    "名称": "强力药水", 
    "原名": "Bloster Potion", 
    "效果": "下一次力量掷骰+1" 
  },
  {
    "roll": 3, 
    "名称": "控制药水", 
    "原名": "Control Potion", 
    "效果": "下一次灵巧掷骰+1" 
  },
  {
    "roll": 4, 
    "名称": "调和药水", 
    "原名": "Attune Potion", 
    "效果": "下一次本能掷骰+1" 
  },
  {
    "roll": 5, 
    "名称": "魅力药水", 
    "原名": "Charm Potion", 
    "效果": "下一次风度掷骰+1" 
  },
  {
    "roll": 6, 
    "名称": "启迪药水", 
    "原名": "Enlighten Potion", 
    "效果": "下一次知识掷骰+1" 
  },
  {
    "roll": 7, 
    "名称": "小型生命药水", 
    "原名": "Minor Health Potion", 
    "效果": "立刻回复1d4生命值" 
  },
  {
    "roll": 8, 
    "名称": "小型耐力药水", 
    "原名": "Minor Stamina Potion", 
    "效果": "立刻清除1d4压力" 
  },
  {
    "roll": 9, 
    "名称": "磨牙毒液", 
    "原名": "Grindletooth Venom", 
    "效果": "附在物理武器上，在其下一次的伤害掷骰中增加1d6" 
  },
  {
    "roll": 10, 
    "名称": "瓦里克叶", 
    "原名": "Varik Leaves", 
    "效果": "立刻获得2希望点" 
  },
  {
    "roll": 11, 
    "名称": "月滴瓶", 
    "原名": "Vial of Moondrip", 
    "效果": "直至你的下一次短休, 你可以在完全黑暗的环境中看到东西" 
  },
  {
    "roll": 12, 
    "名称": "不稳定的奥术碎片", 
    "原名": "Unstable Arcane Shard", 
    "效果": "使用灵巧将其投掷到远距离范围内的一群敌人，所有成功对抗的敌人受到1d20魔法伤害（TODO：AOE？）" 
  },
  {
    "roll": 13, 
    "名称": "稳定药水", 
    "原名": "Potion of Stability", 
    "效果": "使用后立刻执行一次额外的休息行动" 
  },
  {
    "roll": 14, 
    "名称": "改良磨牙毒液", 
    "原名": "Improved Grindletooth Venom", 
    "效果": "附在物理武器上，在其下一次的伤害掷骰中增加1d8" 
  },
  {
    "roll": 15, 
    "名称": "变形黏土", 
    "原名": "Morphing Clay", 
    "效果": "花费1希望点，使用者将会改变他们的容貌使其他人认不出来，直到下次短休" 
  },
  {
    "roll": 16, 
    "名称": "黑烟瓶", 
    "原名": "Vial of Darksmoke", 
    "效果": "面对即将到来的攻击时，骰等同于你敏捷数的d6，将其中最高的结果加入到你应对此次攻击的的闪避值中" 
  },
  {
    "roll": 17, 
    "名称": "跳跃树根", 
    "原名": "Jumping Root", 
    "效果": "仅一次，你可以无需掷骰地跳跃到远距离内的任何地方。" 
  },
  {
    "roll": 18, 
    "名称": "小憩粉", 
    "原名": "Snap Powder", 
    "效果": "标记1点压力然后恢复1点生命值" 
  },
  {
    "roll": 19, 
    "名称": "生命药水", 
    "原名": "Health Potion", 
    "效果": "立刻回复1d4+1生命值" 
  },
  {
    "roll": 20, 
    "名称": "耐力药水", 
    "原名": "Stamina Potion", 
    "效果": "立刻清除1d4+1压力" 
  },
  {
    "roll": 21, 
    "名称": "护甲缝合剂", 
    "原名": "Armor Stitcher", 
    "效果": "使用此物品并花费任意希望点，修复等量的护甲槽" 
  },
  {
    "roll": 22, 
    "名称": "鳃膏", 
    "原名": "Gill Salve", 
    "效果": "你可以在水下呼吸，时间为你的等级数的分钟" 
  },
  {
    "roll": 23, 
    "名称": "复制羊皮纸", 
    "原名": "Replication Parchment", 
    "效果": "当你将这张羊皮纸与另一张羊皮纸接触时，它会精确复制。一旦将其制成此副本，它就不再是复制羊皮纸了。" 
  },
  {
    "roll": 24, 
    "名称": "改良奥术碎片", 
    "原名": "Improved Arcane Shard", 
    "效果": "使用灵巧将其投掷到远距离范围内的一群敌人，所有成功对抗的敌人受到2d20魔法伤害（TODO：AOE？）" 
  },
  {
    "roll": 25, 
    "名称": "强效神行药水", 
    "原名": "Major Stride Potion", 
    "效果": "直到下一次长休或短休时，敏捷掷骰+1" 
  },
  {
    "roll": 26, 
    "名称": "强效强力药水", 
    "原名": "Major Bloster Potion", 
    "效果": "直到下一次长休或短休时，力量掷骰+1" 
  },
  {
    "roll": 27, 
    "名称": "强效控制药水", 
    "原名": "Major Control Potion", 
    "效果": "直到下一次长休或短休时，灵巧掷骰+1" 
  },
  {
    "roll": 28, 
    "名称": "强效调和药水", 
    "原名": "Major Attune Potion", 
    "效果": "直到下一次长休或短休时，本能掷骰+1" 
  },
  {
    "roll": 29, 
    "名称": "强效魅力药水", 
    "原名": "Major Charm Potion", 
    "效果": "直到下一次长休或短休时，风度掷骰+1" 
  },
  {
    "roll": 30, 
    "名称": "强效启迪药水", 
    "原名": "Major Enlighten Potion", 
    "效果": "直到下一次长休或短休时，知识掷骰+1" 
  },
  {
    "roll": 31, 
    "名称": "约尔吉之血", 
    "原名": "Blood of the Yorgi", 
    "效果": "瞬移至可目视的极远范围内任意地方" 
  },
  {
    "roll": 32, 
    "名称": "霍莫特的秘药", 
    "原名": "Homet's Secret Potion", 
    "效果": "饮用后，你的下一次攻击掷骰自动关键成功" 
  },
  {
    "roll": 33, 
    "名称": "红棘唾液", 
    "原名": "Redthorn Saliva", 
    "效果": "附在物理武器上，在其下一次的伤害掷骰中增加1d12" 
  },
  {
    "roll": 34, 
    "名称": "引导石", 
    "原名": "Channelstone", 
    "效果": "选择你宝库中的一个法术或术典，使用1次然后将其放回宝库" 
  },
  {
    "roll": 35, 
    "名称": "秘尘", 
    "原名": "Misty Dust", 
    "效果": "附在魔法武器上，在其下一次的伤害掷骰中增加1d12" 
  },
  {
    "roll": 36, 
    "名称": "酸膏", 
    "原名": "Acidpaste", 
    "效果": "在明亮的闪光中侵蚀墙壁和其他表面。" 
  },
  {
    "roll": 37, 
    "名称": "希望火炬", 
    "原名": "Hopehold Flare", 
    "效果": "使用时，近距离内的盟友每花费1希望点时掷一个d6。掷出 6 时可无需花费1希望点。效果持续到下一个场景。" 
  },
  {
    "roll": 38, 
    "名称": "强效奥术碎片", 
    "原名": "MajorArcane Shard", 
    "效果": "使用灵巧将其投掷到远距离范围内的一群敌人，所有成功对抗的敌人受到4d20魔法伤害（ TODO：AOE？）" 
  },
  {
    "roll": 39, 
    "名称": "羽骨", 
    "原名": "Featherbone", 
    "效果": "控制你的下坠速度，效果时间等同于你等级数的分钟" 
  },
  {
    "roll": 40, 
    "名称": "虚空之环", 
    "原名": "Circle of the Void", 
    "效果": "标记1点压力值，创造一个延伸至远距范围的虚空区域。虚空内无法施放任何法术，区域内生物对魔法伤害免疫。" 
  },
  {
    "roll": 41, 
    "名称": "太阳树液", 
    "原名": "Sun Tree Sap", 
    "效果": "骰1d6。若骰出5-6，恢复2点生命值。若骰出2-4，清除3点压力。若骰出1，你短暂地面对死亡并回生，获得1道伤痕" 
  },
  {
    "roll": 42, 
    "名称": "滴牙毒药", 
    "原名": "Dripfang Poison", 
    "效果": "对饮用此物品的生物造成8d10的直接伤害" 
  },
  {
    "roll": 43, 
    "名称": "强效生命药水", 
    "原名": "Major Health Potion", 
    "效果": "立刻回复1d4+2生命值" 
  },
  {
    "roll": 44, 
    "名称": "强效耐力药水", 
    "原名": "Major Stamina Potion", 
    "效果": "立刻清除1d4+2压力" 
  },
  {
    "roll": 45, 
    "名称": "食人魔麝香", 
    "原名": "Ogre Musk", 
    "效果": "避免任何人使用物理或魔法手段追踪你，直至你的下一次长休或短休。" 
  },
  {
    "roll": 46, 
    "名称": "翼芽", 
    "原名": "Wingsprout", 
    "效果": "你获得一对魔法翅膀，允许你短暂地飞行，飞行时间等同于你等级数的分钟" 
  },
  {
    "roll": 47, 
    "名称": "失落声音之罐", 
    "原名": "Jar of Lost Voices", 
    "效果": "释放出一股让人耳聋的声波，持续等同于你本能属性数值的分钟。任何在远距离范围内没有准备应对的生物受到6d8的魔法伤害" 
  },
  {
    "roll": 48, 
    "名称": "龙花茶", 
    "原名": "Dragonbloom Tea", 
    "效果": "使用本能掷骰，对你面前的所有近距离敌人进行火焰吐息攻击。成功时，造成熟练*d20 物理伤害。" 
  },
  {
    "roll": 49, 
    "名称": "桥之种子", 
    "原名": "Bridge Seed", 
    "效果": "一束厚重的藤蔓从你所在的地方长出，延伸至远距离范围内的一处，允许你在其上安全地攀爬或步行。藤蔓在你的下一次短休时消散。" 
  },
  {
    "roll": 50, 
    "名称": "睡眠树液", 
    "原名": "Sleeping Sap", 
    "效果": "饮用后陷入一整晚的沉睡。醒来时消除所有压力。" 
  },
  {
    "roll": 51, 
    "名称": "舒利亚的盛宴", 
    "原名": "Feast of Xuria", 
    "效果": "食用后可以恢复所有生命值与清除所有压力值，并获得1d4希望点" 
  },
  {
    "roll": 52, 
    "名称": "捆绑蜂蜜", 
    "原名": "Bonding Honey", 
    "效果": "将两件物品永久性地粘连在一起" 
  },
  {
    "roll": 53, 
    "名称": "缩小药水", 
    "原名": "Shrinking Potion", 
    "效果": "饮用者的体型会缩小至一半，获得 +2 敏捷 -1 熟练，直到他选择放弃这种形态或进行下一次长休或短休。" 
  },
  {
    "roll": 54, 
    "名称": "生长药水", 
    "原名": "Growing Potion", 
    "效果": "饮用者的体型会放大至两倍，获得 +2 力量 +1 熟练，直到他选择放弃这种形态或进行下一次长休或短休。" 
  },
  {
    "roll": 55, 
    "名称": "知识石", 
    "原名": "Knowledge Stone", 
    "效果": "如果你持有此石头时死亡，一名盟友可以从你的配置中拿取一张卡加入其配置或宝库。当他们如此做后，石头将会粉碎。" 
  },
  {
    "roll": 56, 
    "名称": "甜蜜苔藓", 
    "原名": "Sweet Moss", 
    "效果": "在长休或短休期间食用，可以恢复1d4生命或清除1d4压力" 
  },
  {
    "roll": 57, 
    "名称": "目盲法球", 
    "原名": "Blinding Orb", 
    "效果": "创造一道明亮的闪光，使近距离范围内的所有生物陷入脆弱状态，直至他们下一次失去生命值" 
  },
  {
    "roll": 58, 
    "名称": "死亡茶", 
    "原名": "Death Tea", 
    "效果": "饮下此茶后，若你在攻击时取得关键成功，将立即杀死目标。若在下次长休前未取得攻击大成功，你将死亡。" 
  },
  {
    "roll": 59, 
    "名称": "万寿菊之镜", 
    "原名": "Mirror of Marigold", 
    "效果": "当你受到伤害时，可花费1希望点完全抵消该伤害，随后镜子碎裂。" 
  },
  {
    "roll": 60, 
    "名称": "星之泪", 
    "原名": "Stardrop", 
    "效果": "使用以召唤一场流星雨，对以使用地点为圆心的极远距离内所有生物自动造成8d20物理伤害" 
  }
];