const SECONDARY_WEAPON = [
    {
        "名称": "短剑",
        "属性": "敏捷",
        "距离": "近战",
        "伤害": "d8",
        "双手": "副手",
        "类型": "物理",
        "特性": "**双持：**近战时主武器伤害+2。",
        "位阶": 1
    },
    {
        "名称": "圆盾",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d4",
        "双手": "副手",
        "类型": "物理",
        "特性": "**保护：**护甲值+1。",
        "位阶": 1
    },
    {
        "名称": "塔盾",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d6",
        "双手": "副手",
        "类型": "物理",
        "特性": "**壁垒：**+2护甲值，-1闪避值。",
        "位阶": 1
    },
    {
        "名称": "小匕首",
        "属性": "灵巧",
        "距离": "近战",
        "伤害": "d8",
        "双手": "副手",
        "类型": "物理",
        "特性": "**双持：**近战时主武器伤害+2。",
        "位阶": 1
    },
    {
        "名称": "鞭子",
        "属性": "风度",
        "距离": "邻近",
        "伤害": "d6",
        "双手": "副手",
        "类型": "物理",
        "特性": "**鞭笞：****标记 1 压力点**，将所有近战范围内的敌人击退至近距离。",
        "位阶": 1
    },
    {
        "名称": "抓钩",
        "属性": "灵巧",
        "距离": "近距离",
        "伤害": "d6",
        "双手": "副手",
        "类型": "物理",
        "特性": "**出钩：**进行一次成功的攻击后，你可以将目标拉至你的近战范围内。",
        "位阶": 1
    },
    {
        "名称": "手弩",
        "属性": "灵巧",
        "距离": "远距离",
        "伤害": "d6+1",
        "双手": "副手",
        "类型": "物理",
        "特性": "",
        "位阶": 1
    },
    {
        "名称": "改良短剑",
        "属性": "敏捷",
        "距离": "近战",
        "伤害": "d8+2",
        "双手": "副手",
        "类型": "物理",
        "特性": "**双持：**近战时主武器伤害+3。",
        "位阶": 2
    },
    {
        "名称": "改良圆盾",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d4+2",
        "双手": "副手",
        "类型": "物理",
        "特性": "**保护：**护甲值+2。",
        "位阶": 2
    },
    {
        "名称": "改良塔盾",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d6+2",
        "双手": "副手",
        "类型": "物理",
        "特性": "**壁垒：**护甲值+3，闪避值-1。",
        "位阶": 2
    },
    {
        "名称": "改良小匕首",
        "属性": "灵巧",
        "距离": "近战",
        "伤害": "d8+2",
        "双手": "副手",
        "类型": "物理",
        "特性": "**双持：**近战时主武器伤害+3。",
        "位阶": 2
    },
    {
        "名称": "改良鞭子",
        "属性": "风度",
        "距离": "邻近",
        "伤害": "d6+2",
        "双手": "副手",
        "类型": "物理",
        "特性": "**鞭笞：****标记 1 压力点**，将所有近战范围内的敌人击退至近距离。",
        "位阶": 2
    },
    {
        "名称": "改良抓钩",
        "属性": "灵巧",
        "距离": "近距离",
        "伤害": "d6+2",
        "双手": "副手",
        "类型": "物理",
        "特性": "**出钩：**进行一次成功的攻击后，你可以将目标拉至你的近战范围内。",
        "位阶": 2
    },
    {
        "名称": "改良手弩",
        "属性": "灵巧",
        "距离": "远距离",
        "伤害": "d6+3",
        "双手": "副手",
        "类型": "物理",
        "特性": "",
        "位阶": 2
    },
    {
        "名称": "尖刺盾牌",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d6+2",
        "双手": "副手",
        "类型": "物理",
        "特性": "**两用：**护甲值+1，近战时主武器伤害+1。",
        "位阶": 2
    },
    {
        "名称": "格挡匕首",
        "属性": "灵巧",
        "距离": "近战",
        "伤害": "d6+2",
        "双手": "副手",
        "类型": "物理",
        "特性": "**格挡：**在你被攻击时，掷出该武器的伤害骰。如果有任何与攻击者匹配的骰子，则在伤害总计之前将其移除。",
        "位阶": 2
    },
    {
        "名称": "回力斧",
        "属性": "敏捷",
        "距离": "近距离",
        "伤害": "d6+4",
        "双手": "副手",
        "类型": "物理",
        "特性": "**回力：**当此武器在射程内被投掷后，会在完成攻击的瞬间重新出现在你手中。",
        "位阶": 2
    },
    {
        "名称": "高级短剑",
        "属性": "敏捷",
        "距离": "近战",
        "伤害": "d8+4",
        "双手": "副手",
        "类型": "物理",
        "特性": "**双持：**近战时主武器伤害+4。",
        "位阶": 3
    },
    {
        "名称": "高级圆盾",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d4+4",
        "双手": "副手",
        "类型": "物理",
        "特性": "**保护：**护甲值+3。",
        "位阶": 3
    },
    {
        "名称": "高级塔盾",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d6+4",
        "双手": "副手",
        "类型": "物理",
        "特性": "**壁垒：**护甲值+4，闪避值-1。",
        "位阶": 3
    },
    {
        "名称": "高级小匕首",
        "属性": "灵巧",
        "距离": "近战",
        "伤害": "d8+4",
        "双手": "副手",
        "类型": "物理",
        "特性": "**双持：**近战时主武器伤害+4。",
        "位阶": 3
    },
    {
        "名称": "高级鞭子",
        "属性": "风度",
        "距离": "邻近",
        "伤害": "d6+4",
        "双手": "副手",
        "类型": "物理",
        "特性": "**鞭笞：****标记 1 压力点**，将所有近战范围内的敌人击退至近距离。",
        "位阶": 3
    },
    {
        "名称": "高级抓钩",
        "属性": "灵巧",
        "距离": "近距离",
        "伤害": "d6+4",
        "双手": "副手",
        "类型": "物理",
        "特性": "**出钩：**进行一次成功的攻击后，你可以将目标拉至你的近战范围内。",
        "位阶": 3
    },
    {
        "名称": "高级手弩",
        "属性": "灵巧",
        "距离": "远距离",
        "伤害": "d6+5",
        "双手": "副手",
        "类型": "物理",
        "特性": "",
        "位阶": 3
    },
    {
        "名称": "小盾",
        "属性": "敏捷",
        "距离": "近战",
        "伤害": "d4+4",
        "双手": "副手",
        "类型": "物理",
        "特性": "**反射：**面对即将到来的攻击时，你可以**标记 1 护甲槽**，你的闪避值获得等同于你护甲值的加值。",
        "位阶": 3
    },
    {
        "名称": "强力拳套",
        "属性": "知识",
        "距离": "近距离",
        "伤害": "d6+4",
        "双手": "副手",
        "类型": "物理",
        "特性": "**充能攻击：****标记 1 压力点**，为主武器的攻击熟练+1。",
        "位阶": 3
    },
    {
        "名称": "弹弓",
        "属性": "灵巧",
        "距离": "极远",
        "伤害": "d6+4",
        "双手": "副手",
        "类型": "物理",
        "特性": "**多用：**这把武器也可以此方式使用 - 灵巧 近距离 d8+4。",
        "位阶": 3
    },
    {
        "名称": "传奇短剑",
        "属性": "敏捷",
        "距离": "近战",
        "伤害": "d8+6",
        "双手": "副手",
        "类型": "物理",
        "特性": "**双持：**近战时主武器伤害+5。",
        "位阶": 4
    },
    {
        "名称": "传奇圆盾",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d4+6",
        "双手": "副手",
        "类型": "物理",
        "特性": "**保护：**护甲值+4。",
        "位阶": 4
    },
    {
        "名称": "传奇塔盾",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d6+6",
        "双手": "副手",
        "类型": "物理",
        "特性": "**壁垒：**护甲值+5，闪避值-1。",
        "位阶": 4
    },
    {
        "名称": "传奇小匕首",
        "属性": "灵巧",
        "距离": "近战",
        "伤害": "d8+6",
        "双手": "副手",
        "类型": "物理",
        "特性": "**双持：**近战时主武器伤害+5。",
        "位阶": 4
    },
    {
        "名称": "传奇鞭子",
        "属性": "风度",
        "距离": "邻近",
        "伤害": "d6+6",
        "双手": "副手",
        "类型": "物理",
        "特性": "**鞭笞：****标记 1 压力点**，将所有近战范围内的敌人击退至近距离。",
        "位阶": 4
    },
    {
        "名称": "传奇抓钩",
        "属性": "灵巧",
        "距离": "近距离",
        "伤害": "d6+6",
        "双手": "副手",
        "类型": "物理",
        "特性": "**出钩：**进行一次成功的攻击后，你可以将目标拉至你的近战范围内。",
        "位阶": 4
    },
    {
        "名称": "传奇手弩",
        "属性": "灵巧",
        "距离": "远距离",
        "伤害": "d6+7",
        "双手": "副手",
        "类型": "物理",
        "特性": "",
        "位阶": 4
    },
    {
        "名称": "勇气之盾",
        "属性": "敏捷",
        "距离": "近战",
        "伤害": "d4+6",
        "双手": "副手",
        "类型": "物理",
        "特性": "**庇护：**当你**标记 1 护甲槽**时，它将为你和所有近战范围内受到同源伤害的盟友减免伤害。",
        "位阶": 4
    },
    {
        "名称": "拳爪",
        "属性": "力量",
        "距离": "近战",
        "伤害": "d6+8",
        "双手": "副手",
        "类型": "物理",
        "特性": "**双击：**当你使用主武器进行一次攻击后，你可以同时使用此武器对另一名近战范围内的敌人造成伤害。",
        "位阶": 4
    },
    {
        "名称": "引物碎片",
        "属性": "本能",
        "距离": "邻近",
        "伤害": "d4",
        "双手": "副手",
        "类型": "物理",
        "特性": "**锁定：**使用此武器对成功攻击一名敌人后，你的主武器对其的下一次攻击将自动命中。",
        "位阶": 4
    }
];