const LOOT = {
    "items": [
        {
            "roll": "01",
            "name": "高级床单",
            "desc": "在任何休息期间，你总是会自动**清除 1 压力点**。"
        },
        {
            "roll": "02",
            "name": "风笛哨",
            "desc": "手工制作的哨子。每只哨子都有独特的声音，刺耳的声音在半径一英里的地方都能听到。"
        },
        {
            "roll": "03",
            "name": "充能箭袋",
            "desc": "当你使用此箭袋中的箭矢攻击并成功命中时，伤害掷骰获得等同于你当前位阶的加值。"
        },
        {
            "roll": "04",
            "name": "阿利斯泰尔的火炬",
            "desc": "一把可以随心所欲点亮的魔法火炬，它发出的光比看起来要远得多。它可以让洞穴充满光亮，让人感觉就像白天一样。"
        },
        {
            "roll": "05",
            "name": "通话法球",
            "desc": "一对球体，任何持有它们的生物都可以在任意距离内相互交流。"
        },
        {
            "roll": "06",
            "name": "手铐",
            "desc": "一副带有钥匙的可锁手铐。"
        },
        {
            "roll": "07",
            "name": "奥术斗篷",
            "desc": "任何拥有施法能力的使用者穿着它时都可以随意调整其颜色、纹理和尺寸的斗篷。"
        },
        {
            "roll": "08",
            "name": "编织网",
            "desc": "你可以用这张网进行 灵巧检定 来捕捉小型生物。被网住的目标可通过成功的 攻击检定 （DC16）挣脱。"
        },
        {
            "roll": "09",
            "name": "生火罐",
            "desc": "你可以倾倒此罐中奇异的液体来立即产生火焰。液体将在你完成长休后重新生成。"
        },
        {
            "roll": "10",
            "name": "悬空之杖",
            "desc": "这根刻有符文的扁平短棒被激活时会立即悬停在原地。在解除激活前，短棒将不受重力影响且无法移动，始终固定在原位。"
        },
        {
            "roll": "11",
            "name": "魅力石",
            "desc": "激活这颗卵石大小的宝石，可记录你所见之人的外貌。**花费 1 希望点**，便能以幻象形式将这副伪装神奇地复现在自己身上。"
        },
        {
            "roll": "12",
            "name": "空箱子",
            "desc": "一个魔法箱子，即使里面有物品，看起来也是空的。主人可以在打开箱子时使用特定的单词、短语或其他触发条件来显示这些物品。"
        },
        {
            "roll": "13",
            "name": "伙伴箱",
            "desc": "用于携带小型动物伙伴的箱子。当它们在里面时，箱子和里面的生物动物都不会受到任何伤害和负面魔法效果。"
        },
        {
            "roll": "14",
            "name": "穿刺箭",
            "desc": "使用弓进行攻击时，你可以使用穿刺箭将你的熟练值添加到伤害掷骰中。每短休可使用 3 次。"
        },
        {
            "roll": "15",
            "name": "勇气石",
            "desc": "附在盔甲上。为尚未具备以下功能的盔甲添加以下特性：坚韧：在标记最后一个护甲槽之前，掷一个 d6。如果掷出6，则可以降低伤害一个等级而无需标记槽位"
        },
        {
            "roll": "16",
            "name": "万能钥匙",
            "desc": "使尝试打开锁着的门时的灵巧掷骰具有优势"
        },
        {
            "roll": "17",
            "name": "奥术棱镜",
            "desc": "将此棱镜置于指定位置并激活。其近距离范围内的所有盟友在施法检定上获得+1加值。激活期间棱镜不可移动。解除激活后，需完成一次长休才能再次启用。"
        },
        {
            "roll": "18",
            "name": "小型耐力药水配方",
            "desc": "花费一项修整行动和动物骨骼来制作一瓶小型耐力药水。"
        },
        {
            "roll": "19",
            "name": "小型生命药水配方",
            "desc": "花费一项修整行动和一瓶血液来制作一瓶小型生命药水。"
        },
        {
            "roll": "20",
            "name": "归航罗盘",
            "desc": "两个罗盘无论相距多远，都只能指向对方。"
        },
        {
            "roll": "21",
            "name": "修正者精魂",
            "desc": "一只坐在你耳道弯曲处的小精魂，在战斗中低声说着有用的建议。每短休一次，你可以在攻击检定中获得一次优势。不要告诉精魂你的真名。"
        },
        {
            "roll": "22",
            "name": "壁虎手套",
            "desc": "你可以爬上垂直表面并穿过天花板。"
        },
        {
            "roll": "23",
            "name": "博学守护者",
            "desc": "存储最多三个敌对生物的名字。下次面对它们时，在针对它们的任何动作掷骰上获得 +1。"
        },
        {
            "roll": "24",
            "name": "黑烟瓶配方",
            "desc": "在休息时间，花费一次休息动作并**标记 1 压力点**来制作一个黑烟瓶。                                                                                                                        :"
        },
        {
            "roll": "25",
            "name": "血石",
            "desc": "附在武器上。为尚未具备以下功能的武器添加以下特性：残暴: 伤害骰每掷出一次最大值，就额外掷出一个伤害骰。"
        },
        {
            "roll": "26",
            "name": "巨石",
            "desc": "附在武器上。为尚未具备以下功能的武器添加以下特性：强力: 额外掷一个伤害骰并去掉其中最小的一个。"
        },
        {
            "roll": "27",
            "name": "滑翔机",
            "desc": "可以通过**标记 1 压力点**来展开的小型降落伞。它可以让使用者从高处安全地滑翔到下面的地面。"
        },
        {
            "roll": "28",
            "name": "寂静戒指",
            "desc": "**花费 1 希望点**激活此戒指，直到你的下一次短休，你的脚步声是无声的。"
        },
        {
            "roll": "29",
            "name": "镇静吊坠",
            "desc": "如果你必须标记最后一个压力槽，请掷一个 d6。如果掷出 5+，则无需标记。"
        },
        {
            "roll": "30",
            "name": "双用瓶",
            "desc": "可容纳两种不同液体的瓶子。侧面的小按钮可让饮用者在两种液体之间切换。"
        },
        {
            "roll": "31",
            "name": "幻沙袋",
            "desc": "这是一小袋沙子，可以通过 风度掷骰（DC10）将其调整为比实际重量重得多或轻得多。你还可以通过 灵巧掷骰（DC10） 将沙子吹到对手的脸上，使对手暂时处于脆弱状态。"
        },
        {
            "roll": "32",
            "name": "抵抗戒指",
            "desc": "每长休一次，激活这枚戒指使将受到的伤害减少一半。"
        },
        {
            "roll": "33",
            "name": "凤凰羽毛",
            "desc": "只要你拥有任意数量的凤凰羽毛，当你失去知觉并掷骰查看是否选择留下伤痕时，骰子结果总是+1。"
        },
        {
            "roll": "34",
            "name": "百宝箱",
            "desc": "一个只能每长休打开一次的小盒子。打开时，骰一个d12，如果你掷出1-6，盒子是空的；如果你掷出7-10，盒子里会随机出现一个常见消耗品；如果你掷出11-12，盒子里会随机出现两个常见消耗品。"
        },
        {
            "roll": "35",
            "name": "空刃护符",
            "desc": "附在近战武器上，使其能够在近距离范围内攻击。每短休三次。"
        },
        {
            "roll": "36",
            "name": "传送点种子",
            "desc": "将此种子埋入土中可在该处培育传送门。24小时后传送门即可使用。通过此传送门可抵达任何其他已种植传送门种子的地点。对传送门造成任意魔法伤害即可将其摧毁。"
        },
        {
            "roll": "37",
            "name": "典范之链",
            "desc": "每次长休时，你可以使用休息行动来冥想你所珍视的理想或原则，并将你的意志集中到链条中。在下一次长休之前，你可以**花费 1 希望点**，使用 d20 作为希望骰，进行与该原则一致的掷骰。"
        },
        {
            "roll": "38",
            "name": "匿踪护身符",
            "desc": "每长休一次，激活此护符进入隐匿状态直至移动。以此法隐匿期间，即使敌人移动至通常能看见你的位置，你仍保持不可见状态。"
        },
        {
            "roll": "39",
            "name": "希望守护者的小盒",
            "desc": "在长休期间，若你拥有 6 希望点，可**花费 1 希望点**将丰沛的决心灌注于此挂坠中。当希望点归零时，可使用该挂坠立即**获得 1 希望点**。挂坠必须重新灌注后才能再次以此法使用。"
        },
        {
            "roll": "40",
            "name": "无限袋",
            "desc": "放入此袋中的物品将存储在一个独立的次元中且可以随时取出。"
        },
        {
            "roll": "41",
            "name": "神行遗宝",
            "desc": "敏捷+1，你不能同时持有其他遗宝。"
        },
        {
            "roll": "42",
            "name": "强力遗宝",
            "desc": "力量+1，你不能同时持有其他遗宝。"
        },
        {
            "roll": "43",
            "name": "控制遗宝",
            "desc": "灵巧+1，你不能同时持有其他遗宝。"
        },
        {
            "roll": "44",
            "name": "调和遗宝",
            "desc": "本能+1，你不能同时持有其他遗宝。"
        },
        {
            "roll": "45",
            "name": "魅力遗宝",
            "desc": "风度+1，你不能同时持有其他遗宝。"
        },
        {
            "roll": "46",
            "name": "启迪遗宝",
            "desc": "知识+1，你不能同时持有其他遗宝。"
        },
        {
            "roll": "47",
            "name": "珩磨遗宝",
            "desc": "你的一项经历+1，你不能同时持有其他遗宝。"
        },
        {
            "roll": "48",
            "name": "闪烁飞虫吊坠",
            "desc": "佩戴时，你的物理近战武器会像薄纱一样延伸，使你可以攻击邻近范围内的生物。"
        },
        {
            "roll": "49",
            "name": "湖行者长靴",
            "desc": "你可以如同在柔软地面一般行走在水面上。"
        },
        {
            "roll": "50",
            "name": "粘土伙伴",
            "desc": "当你将这块黏土塑造成黏土动物伙伴时，它会表现出相应动物的特性。例如黏土蜘蛛能编织黏土蛛网，黏土飞鸟则可翱翔天际。黏土伙伴在不同形态间会保留记忆与身份认同，但每次变形都可能习得新的习性。"
        },
        {
            "roll": "51",
            "name": "秘尘配方",
            "desc": "在休息时，花费一项修整行动和一包金币来制作一份秘尘。"
        },
        {
            "roll": "52",
            "name": "记忆碎片",
            "desc": "每次长休一次，**花费 2 希望点**以回想一张宝库内的领域卡，而不是支付其回想费用。"
        },
        {
            "roll": "53",
            "name": "欢欣宝石",
            "desc": "附在武器上，允许你使用敏捷进行攻击掷骰。"
        },
        {
            "roll": "54",
            "name": "威力宝石",
            "desc": "附在武器上，允许你使用力量进行攻击掷骰。"
        },
        {
            "roll": "55",
            "name": "精准宝石",
            "desc": "附在武器上，允许你使用灵巧进行攻击掷骰。"
        },
        {
            "roll": "56",
            "name": "洞察宝石",
            "desc": "附在武器上，允许你使用本能进行攻击掷骰。"
        },
        {
            "roll": "57",
            "name": "无畏宝石",
            "desc": "附在武器上，允许你使用风度进行攻击掷骰。"
        },
        {
            "roll": "58",
            "name": "睿智宝石",
            "desc": "附在武器上，允许你使用知识进行攻击掷骰。"
        },
        {
            "roll": "59",
            "name": "坚毅之戒",
            "desc": "每场游戏一次，当游戏主持人**花费 1 恐惧点**时，你可以**花费 4 希望点**以取消因为使用恐惧而产生的效应。"
        },
        {
            "roll": "60",
            "name": "团结腰带",
            "desc": "每场游戏一次，你可以**花费 5 希望点**进行一次三名角色的接力掷骰，而不是两名。"
        }
    ],
    "consumables": [
        {
            "roll": "01",
            "name": "神行药水",
            "desc": "下一次敏捷掷骰+1。"
        },
        {
            "roll": "02",
            "name": "强力药水",
            "desc": "下一次力量掷骰+1。"
        },
        {
            "roll": "03",
            "name": "控制药水",
            "desc": "下一次灵巧掷骰+1。"
        },
        {
            "roll": "04",
            "name": "调和药水",
            "desc": "下一次本能掷骰+1。"
        },
        {
            "roll": "05",
            "name": "魅力药水",
            "desc": "下一次风度掷骰+1。"
        },
        {
            "roll": "06",
            "name": "启迪药水",
            "desc": "下一次知识掷骰+1。"
        },
        {
            "roll": "07",
            "name": "小型生命药水",
            "desc": "立刻**恢复 1d4 生命点**。"
        },
        {
            "roll": "08",
            "name": "小型耐力药水",
            "desc": "立刻**清除 1d4 压力点**。"
        },
        {
            "roll": "09",
            "name": "磨牙毒液",
            "desc": "附在物理武器上，在其下一次的伤害掷骰中增加 1d6 。"
        },
        {
            "roll": "10",
            "name": "瓦里克叶",
            "desc": "立刻**获得 2 希望点**。"
        },
        {
            "roll": "11",
            "name": "月滴瓶",
            "desc": "直至你的下一次短休, 你可以在完全黑暗的环境中看到东西。"
        },
        {
            "roll": "12",
            "name": "不稳定的奥术碎片",
            "desc": "使用灵巧掷骰将其投掷到远距离范围内的一群敌人，所有成功对抗的敌人受到1d20魔法伤害。"
        },
        {
            "roll": "13",
            "name": "稳定药水",
            "desc": "使用后立刻执行一次额外的休息行动。"
        },
        {
            "roll": "14",
            "name": "改良磨牙毒液",
            "desc": "附在物理武器上，在其下一次的伤害掷骰中增加1d8。"
        },
        {
            "roll": "15",
            "name": "变形黏土",
            "desc": "**花费 1 希望点**，使用者将会改变他们的容貌使其他人认不出来，直到下次短休。"
        },
        {
            "roll": "16",
            "name": "黑烟瓶",
            "desc": "面对即将到来的攻击时，骰等同于你敏捷数的 d6，将其中最高的结果加入到你应对此次攻击的的闪避值中。"
        },
        {
            "roll": "17",
            "name": "跳跃树根",
            "desc": "仅一次，你可以无需掷骰地跳跃到远距离内的任何地方。"
        },
        {
            "roll": "18",
            "name": "小憩粉",
            "desc": "**标记 1 压力点**然后**恢复 1 生命点**。"
        },
        {
            "roll": "19",
            "name": "生命药水",
            "desc": "立刻**恢复 1d4+1 生命点**。"
        },
        {
            "roll": "20",
            "name": "耐力药水",
            "desc": "立刻**清除 1d4+1 压力点**。"
        },
        {
            "roll": "21",
            "name": "护甲缝合剂",
            "desc": "使用此物品并**花费 任意 希望点**，**修复 等量的 护甲槽**。"
        },
        {
            "roll": "22",
            "name": "鳃膏",
            "desc": "你可以在水下呼吸，持续时间分钟数等同于你的等级数。"
        },
        {
            "roll": "23",
            "name": "复制羊皮纸",
            "desc": "当你将这张羊皮纸与另一张羊皮纸接触时，它会精确复制。一旦将其制成此副本，它就不再是复制羊皮纸了。"
        },
        {
            "roll": "24",
            "name": "改良奥术碎片",
            "desc": "使用灵巧掷骰将其投掷到远距离范围内的一群敌人，所有成功对抗的敌人受到 2d20 魔法伤害。"
        },
        {
            "roll": "25",
            "name": "强效神行药水",
            "desc": "直到下一次长休或短休时，敏捷掷骰+1。"
        },
        {
            "roll": "26",
            "name": "强效强力药水",
            "desc": "直到下一次长休或短休时，力量掷骰+1。"
        },
        {
            "roll": "27",
            "name": "强效控制药水",
            "desc": "直到下一次长休或短休时，灵巧掷骰+1。"
        },
        {
            "roll": "28",
            "name": "强效调和药水",
            "desc": "直到下一次长休或短休时，本能掷骰+1。"
        },
        {
            "roll": "29",
            "name": "强效魅力药水",
            "desc": "直到下一次长休或短休时，风度掷骰+1。"
        },
        {
            "roll": "30",
            "name": "强效启迪药水",
            "desc": "直到下一次长休或短休时，知识掷骰+1。"
        },
        {
            "roll": "31",
            "name": "约尔吉之血",
            "desc": "瞬移至可目视的极远范围内任意地方。"
        },
        {
            "roll": "32",
            "name": "霍莫特的秘药",
            "desc": "饮用后，你的下一次攻击掷骰自动关键成功。"
        },
        {
            "roll": "33",
            "name": "红棘唾液",
            "desc": "附在物理武器上，在其下一次的伤害掷骰中增加 1d12 。"
        },
        {
            "roll": "34",
            "name": "引导石",
            "desc": "选择你宝库中的一个法术或术典，使用一次然后将其放回宝库。"
        },
        {
            "roll": "35",
            "name": "秘尘",
            "desc": "附在魔法武器上，在其下一次的伤害掷骰中增加 1d12 。"
        },
        {
            "roll": "36",
            "name": "酸膏",
            "desc": "在明亮的闪光中侵蚀墙壁和其他表面。"
        },
        {
            "roll": "37",
            "name": "希望火炬",
            "desc": "使用时，近距离内的盟友每**花费 1 希望点**时掷一个d6。掷出 6 时可无需**花费 1 希望点**。效果持续到下一个场景。"
        },
        {
            "roll": "38",
            "name": "强效奥术碎片",
            "desc": "使用灵巧将其投掷到远距离范围内的一群敌人，所有成功对抗的敌人受到 4d20 魔法伤害。"
        },
        {
            "roll": "39",
            "name": "羽骨",
            "desc": "控制你的下坠速度，持续时间分钟数等同于你的等级数。"
        },
        {
            "roll": "40",
            "name": "虚空之环",
            "desc": "**标记 1 压力点**，创造一个延伸至远距范围的虚空区域。虚空内无法施放任何法术，区域内生物对魔法伤害免疫。"
        },
        {
            "roll": "41",
            "name": "太阳树液",
            "desc": "骰 1d6。若掷出5-6，**恢复 2 生命点**。若掷出2-4，**清除 3 压力点**。若掷出1，你短暂地面对死亡并回生，获得一道伤痕。"
        },
        {
            "roll": "42",
            "name": "滴牙毒药",
            "desc": "对饮用此物品的生物造成 8d10 的直接伤害。"
        },
        {
            "roll": "43",
            "name": "强效生命药水",
            "desc": "立刻**恢复 1d4+2 生命点**。"
        },
        {
            "roll": "44",
            "name": "强效耐力药水",
            "desc": "立刻**清除 1d4+2 压力点** 。"
        },
        {
            "roll": "45",
            "name": "食人魔麝香",
            "desc": "避免任何人使用物理或魔法手段追踪你，直至你的下一次休息。"
        },
        {
            "roll": "46",
            "name": "翼芽",
            "desc": "你获得一对魔法翅膀，允许你短暂地飞行，持续时间分钟数等同于你的等级数。"
        },
        {
            "roll": "47",
            "name": "失落声音之罐",
            "desc": "释放出一股让人耳聋的声波，持续时间分钟数等同于你的本能属性。任何在远距离范围内没有准备应对的生物受到 6d8 的魔法伤害。"
        },
        {
            "roll": "48",
            "name": "龙息茶",
            "desc": "使用本能掷骰，对你面前的所有近距离敌人进行火焰吐息攻击。成功时，造成熟练值*d20 物理伤害。"
        },
        {
            "roll": "49",
            "name": "搭桥种子",
            "desc": "一束厚重的藤蔓从你所在的地方长出，延伸至远距离范围内的一处，允许你在其上安全地攀爬或步行。藤蔓在你的下一次短休时消散。"
        },
        {
            "roll": "50",
            "name": "睡眠树液",
            "desc": "饮用后陷入一整晚的沉睡。醒来时消除所有压力。"
        },
        {
            "roll": "51",
            "name": "舒利亚大餐",
            "desc": "食用后可以恢复所有生命值与清除所有压力值，并**获得 1d4 希望点** 。"
        },
        {
            "roll": "52",
            "name": "捆绑蜂蜜",
            "desc": "将两件物品永久性地粘连在一起。"
        },
        {
            "roll": "53",
            "name": "缩小药水",
            "desc": "饮用者的体型会缩小至一半，敏捷+2，熟练-1，直到他选择放弃这种形态或进行下一次休息。"
        },
        {
            "roll": "54",
            "name": "生长药水",
            "desc": "饮用者的体型会放大至两倍，力量+2 ，熟练+1，直到他选择放弃这种形态或进行下一次休息。"
        },
        {
            "roll": "55",
            "name": "知识石",
            "desc": "如果你持有此石头时死亡，一名盟友可以从你的配置中拿取一张卡加入其配置或宝库。当盟友如此做后，石头将会粉碎。"
        },
        {
            "roll": "56",
            "name": "甜蜜苔藓",
            "desc": "在休息期间食用，可以**恢复 1d4 生命点**或**清除 1d4 压力点**。"
        },
        {
            "roll": "57",
            "name": "目盲法球",
            "desc": "创造一道明亮的闪光，使近距离范围内的所有生物处于脆弱状态，直至生物下一次失去生命点。"
        },
        {
            "roll": "58",
            "name": "死亡茶",
            "desc": "饮下此茶后，若你在攻击时取得关键成功，将立即杀死目标。若在下次长休前未取得攻击关键成功，你将死亡。"
        },
        {
            "roll": "59",
            "name": "万寿菊之镜",
            "desc": "当你受到伤害时，可**花费 1 希望点**完全抵消该伤害，随后镜子碎裂。"
        },
        {
            "roll": "60",
            "name": "星之泪",
            "desc": "使用以召唤一场流星雨，对以使用地点为圆心的极远距离内所有生物自动造成 8d20 物理伤害。"
        }
    ]
}