const weapon_t1_physics = [
    {
        "名称": "阔剑",
        "原名": "Broadsword",
        "检定": "敏捷",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8",
        "负荷": "单手",
        "特性": "可靠: 你的攻击掷骰+1"
    },
    {
        "名称": "长剑",
        "原名": "Longsword",
        "检定": "敏捷",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8+3",
        "负荷": "双手",
        "特性": ""
    },
    {
        "名称": "战斧",
        "原名": "Battleaxe",
        "检定": "力量",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d10+3",
        "负荷": "双手",
        "特性": ""
    },
    {
        "名称": "巨剑",
        "原名": "Greatsword",
        "检定": "力量",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d10+3",
        "负荷": "双手",
        "特性": "巨型: 闪避值-1，额外骰一个伤害骰并去掉其中最小的一个"
    },
    {
        "名称": "钉头锤",
        "原名": "Mace",
        "检定": "力量",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8+1",
        "负荷": "单手",
        "特性": ""
    },
    {
        "名称": "战锤",
        "原名": "Warhammer",
        "检定": "力量",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d12+3",
        "负荷": "双手",
        "特性": "重型: 闪避值-1"
    },
    {
        "名称": "匕首",
        "原名": "Dagger",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8+1",
        "负荷": "单手",
        "特性": ""
    },
    {
        "名称": "短棍",
        "原名": "Quarterstaff",
        "检定": "本能",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d10+3",
        "负荷": "双手",
        "特性": ""
    },
    {
        "名称": "短刀",
        "原名": "Cutlass",
        "检定": "风度",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8+1",
        "负荷": "单手",
        "特性": ""
    },
    {
        "名称": "刺剑",
        "原名": "Rapier",
        "检定": "风度",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8",
        "负荷": "单手",
        "特性": "迅捷: **标记 1 压力点**以额外攻击一个范围内的目标"
    },
    {
        "名称": "戟",
        "原名": "Halberd",
        "检定": "力量",
        "属性": "物理",
        "范围": "邻近",
        "伤害": "d10+2",
        "负荷": "双手",
        "特性": "繁琐: 灵巧-1"
    },
    {
        "名称": "长矛",
        "原名": "Spear",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "邻近",
        "伤害": "d10+2",
        "负荷": "双手",
        "特性": "繁琐: 灵巧-1"
    },
    {
        "名称": "短弓",
        "原名": "Shortbow",
        "检定": "敏捷",
        "属性": "物理",
        "范围": "远距离",
        "伤害": "d6+3",
        "负荷": "双手",
        "特性": ""
    },
    {
        "名称": "弩",
        "原名": "Crossbow",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "远距离",
        "伤害": "d6+1",
        "负荷": "单手",
        "特性": ""
    },
    {
        "名称": "长弓",
        "原名": "Longbow",
        "检定": "敏捷",
        "属性": "物理",
        "范围": "极远",
        "伤害": "d8+3",
        "负荷": "双手",
        "特性": "繁琐: 灵巧-1"
    }
];

const weapon_t1_magic = [
    {
        "名称": "奥术护手",
        "原名": "Arcane Gauntlets",
        "检定": "力量",
        "属性": "魔法",
        "范围": "近战",
        "伤害": "d10+3",
        "负荷": "双手",
        "特性": ""
    },
    {
        "名称": "圣斧",
        "原名": "Hallowed Axe",
        "检定": "力量",
        "属性": "魔法",
        "范围": "近战",
        "伤害": "d8+1",
        "负荷": "单手",
        "特性": ""
    },
    {
        "名称": "发光戒指",
        "原名": "Glowing Rings",
        "检定": "敏捷",
        "属性": "魔法",
        "范围": "邻近",
        "伤害": "d10+1",
        "负荷": "双手",
        "特性": ""
    },
    {
        "名称": "手持符文",
        "原名": "Hand Runes",
        "检定": "本能",
        "属性": "魔法",
        "范围": "邻近",
        "伤害": "d10",
        "负荷": "单手",
        "特性": ""
    },
    {
        "名称": "回力剑",
        "原名": "Returing Blade",
        "检定": "灵巧",
        "属性": "魔法",
        "范围": "近距离",
        "伤害": "d8",
        "负荷": "单手",
        "特性": "回力：当此武器在射程内被投掷后，会在完成攻击的瞬间重新出现在你手中。"
    },
    {
        "名称": "短杖",
        "原名": "Shortstaff",
        "检定": "本能",
        "属性": "魔法",
        "范围": "近距离",
        "伤害": "d8+1",
        "负荷": "单手",
        "特性": ""
    },
    {
        "名称": "双手法杖",
        "原名": "Dualstaff",
        "检定": "本能",
        "属性": "魔法",
        "范围": "远距离",
        "伤害": "d6+3",
        "负荷": "双手",
        "特性": ""
    },
    {
        "名称": "权杖",
        "原名": "Scepter",
        "检定": "风度",
        "属性": "魔法",
        "范围": "远距离",
        "伤害": "d6",
        "负荷": "双手",
        "特性": "多用：这把武器也可以按这些属性使用 - 风度近战d8"
    },
    {
        "名称": "魔杖",
        "原名": "Wand",
        "检定": "知识",
        "属性": "魔法",
        "范围": "远距离",
        "伤害": "d6+1",
        "负荷": "单手",
        "特性": ""
    },
    {
        "名称": "巨杖",
        "原名": "Greatstaff",
        "检定": "知识",
        "属性": "魔法",
        "范围": "极远",
        "伤害": "d6",
        "负荷": "双手",
        "特性": "强力: 额外骰一个伤害骰并去掉其中最小的一个"
    }
];


const weapon_t2_physics = [
    {
        "名称": "改良阔剑",
        "原名": "Improved Broadsword",
        "检定": "敏捷",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8+3",
        "负荷": "单手",
        "特性": "可靠: 你的攻击掷骰+1"
    },
    {
        "名称": "改良长剑",
        "原名": "Improved Longsword",
        "检定": "敏捷",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8+6",
        "负荷": "双手",
        "特性": ""
    },
    {
        "名称": "改良战斧",
        "原名": "Improved Battleaxe",
        "检定": "力量",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d10+6",
        "负荷": "双手",
        "特性": ""
    },
    {
        "名称": "改良巨剑",
        "原名": "Improved Greatsword",
        "检定": "力量",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d10+6",
        "负荷": "双手",
        "特性": "巨型: 闪避值-1，额外骰一个伤害骰并去掉其中最小的一个"
    },
    {
        "名称": "改良钉头锤",
        "原名": "Improved Mace",
        "检定": "力量",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8+4",
        "负荷": "单手",
        "特性": ""
    },
    {
        "名称": "改良战锤",
        "原名": "Improved Warhammer",
        "检定": "力量",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d12+6",
        "负荷": "双手",
        "特性": "重型: 闪避值-1"
    },
    {
        "名称": "改良匕首",
        "原名": "Improved Dagger",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8+4",
        "负荷": "单手",
        "特性": ""
    },
    {
        "名称": "改良短棍",
        "原名": "Improved Quarterstaff",
        "检定": "本能",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d10+6",
        "负荷": "双手",
        "特性": ""
    },
    {
        "名称": "改良短刀",
        "原名": "Improved Cutlass",
        "检定": "风度",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8+4",
        "负荷": "单手",
        "特性": ""
    },
    {
        "名称": "改良刺剑",
        "原名": "Improved Rapier",
        "检定": "风度",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8+3",
        "负荷": "单手",
        "特性": "迅捷: **标记 1 压力点**以额外攻击一个范围内的目标"
    },
    {
        "名称": "改良戟",
        "原名": "Improved Halberd",
        "检定": "力量",
        "属性": "物理",
        "范围": "邻近",
        "伤害": "d10+5",
        "负荷": "双手",
        "特性": "繁琐: 灵巧-1"
    },
    {
        "名称": "改良长矛",
        "原名": "Improved Spear",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "邻近",
        "伤害": "d10+5",
        "负荷": "双手",
        "特性": "繁琐: 灵巧-1"
    },
    {
        "名称": "改良短弓",
        "原名": "Improved Shortbow",
        "检定": "敏捷",
        "属性": "物理",
        "范围": "远距离",
        "伤害": "d6+6",
        "负荷": "双手",
        "特性": ""
    },
    {
        "名称": "改良弩",
        "原名": "Improved Crossbow",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "远距离",
        "伤害": "d6+4",
        "负荷": "单手",
        "特性": ""
    },
    {
        "名称": "改良长弓",
        "原名": "Improved Longbow",
        "检定": "敏捷",
        "属性": "物理",
        "范围": "极远",
        "伤害": "d8+6",
        "负荷": "双手",
        "特性": "繁琐: 灵巧-1"
    },
    {
        "名称": "鎏金弯刀",
        "原名": "Gilded Falchion",
        "检定": "力量",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d10+4",
        "负荷": "单手",
        "特性": "强力: 额外骰一个伤害骰并去掉其中最小的一个"
    },
    {
        "名称": "拳刃",
        "原名": "Knuckle Blades",
        "检定": "力量",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d10+6",
        "负荷": "双手",
        "特性": "残暴: 伤害骰每掷出一次最大值，就额外掷出一个伤害骰"
    },
    {
        "名称": "乌洛克阔剑",
        "原名": "Urok Broadsword",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8+3",
        "负荷": "单手",
        "特性": "致命: 造成严重伤害时，额外造成 1 生命点的伤害"
    },
    {
        "名称": "刃鞭",
        "原名": "Bladed Whip",
        "检定": "敏捷",
        "属性": "物理",
        "范围": "邻近",
        "伤害": "d8+3",
        "负荷": "单手",
        "特性": "迅捷: **标记 1 压力点**以额外攻击一个范围内的目标"
    },
    {
        "名称": "钢铸戟",
        "原名": "Steelforged Halberd",
        "检定": "力量",
        "属性": "物理",
        "范围": "邻近",
        "伤害": "d8+4",
        "负荷": "双手",
        "特性": "恐惧: 成功的攻击同时会额外**标记 1 压力点**"
    },
    {
        "名称": "战镰",
        "原名": "War Scythe",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "邻近",
        "伤害": "d8+5",
        "负荷": "双手",
        "特性": "可靠: 你的攻击掷骰+1"
    },
    {
        "名称": "火铳",
        "原名": "Blunderbuss",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "近距离",
        "伤害": "d8+6",
        "负荷": "双手",
        "特性": "装填: 攻击后骰1d6，如果骰出1，下次攻击前你必须**标记 1 压力点**进行装填"
    },
    {
        "名称": "巨弓",
        "原名": "Greatbow",
        "检定": "力量",
        "属性": "物理",
        "范围": "远距离",
        "伤害": "d6+6",
        "负荷": "双手",
        "特性": "强力: 额外骰一个伤害骰并去掉其中最小的一个"
    },
    {
        "名称": "细弦弓",
        "原名": "Finehair Bow",
        "检定": "敏捷",
        "属性": "物理",
        "范围": "极远",
        "伤害": "d6+5",
        "负荷": "双手",
        "特性": "可靠: 你的攻击掷骰+1"
    }
];

const weapon_t2_magic = [
    {
        "名称": "改良奥术护手",
        "原名": "Improved Arcane Gauntlets",
        "检定": "力量",
        "属性": "魔法",
        "范围": "近战",
        "伤害": "d10+6",
        "负荷": "双手",
        "特性": ""
    },
    {
        "名称": "改良圣斧",
        "原名": "Improved Hallowed Axe",
        "检定": "力量",
        "属性": "魔法",
        "范围": "近战",
        "伤害": "d8+4",
        "负荷": "单手",
        "特性": ""
    },
    {
        "名称": "改良发光戒指",
        "原名": "Improved Glowing Rings",
        "检定": "敏捷",
        "属性": "魔法",
        "范围": "邻近",
        "伤害": "d10+5",
        "负荷": "双手",
        "特性": ""
    },
    {
        "名称": "改良手持符文",
        "原名": "Improved Hand Runes",
        "检定": "本能",
        "属性": "魔法",
        "范围": "邻近",
        "伤害": "d10+3",
        "负荷": "单手",
        "特性": ""
    },
    {
        "名称": "改良回力剑",
        "原名": "Improved Returing Blade",
        "检定": "灵巧",
        "属性": "魔法",
        "范围": "近距离",
        "伤害": "d8+3",
        "负荷": "单手",
        "特性": "回力：当此武器在射程内被投掷后，会在完成攻击的瞬间重新出现在你手中。"
    },
    {
        "名称": "改良短杖",
        "原名": "Shortstaff",
        "检定": "本能",
        "属性": "魔法",
        "范围": "近距离",
        "伤害": "d8+4",
        "负荷": "单手",
        "特性": ""
    },
    {
        "名称": "改良双手法杖",
        "原名": "Improved Dualstaff",
        "检定": "本能",
        "属性": "魔法",
        "范围": "远距离",
        "伤害": "d6+6",
        "负荷": "双手",
        "特性": ""
    },
    {
        "名称": "改良权杖",
        "原名": "Improved Scepter",
        "检定": "风度",
        "属性": "魔法",
        "范围": "远距离",
        "伤害": "d6+3",
        "负荷": "双手",
        "特性": "多用：这把武器也可以按这些属性使用 - 风度近战d8+3"
    },
    {
        "名称": "改良魔杖",
        "原名": "Improved Wand",
        "检定": "知识",
        "属性": "魔法",
        "范围": "远距离",
        "伤害": "d6+4",
        "负荷": "单手",
        "特性": ""
    },
    {
        "名称": "改良巨杖",
        "原名": "Improved Greatstaff",
        "检定": "知识",
        "属性": "魔法",
        "范围": "极远",
        "伤害": "d6+3",
        "负荷": "双手",
        "特性": "强力: 额外骰一个伤害骰并去掉其中最小的一个"
    },
    {
        "名称": "自我之刃",
        "原名": "Ego Blade",
        "检定": "敏捷",
        "属性": "魔法",
        "范围": "近战",
        "伤害": "d12+4",
        "负荷": "单手",
        "特性": "傲慢: 0或者更低的风度才可以使用该武器"
    },
    {
        "名称": "施法剑",
        "原名": "Casting Sword",
        "检定": "力量",
        "属性": "魔法",
        "范围": "近战",
        "伤害": "d10+4",
        "负荷": "双手",
        "特性": "多用：这把武器也可以按这些属性使用 - 知识远距离d6+3"
    },
    {
        "名称": "吞噬匕首",
        "原名": "Devouring Dagger",
        "检定": "灵巧",
        "属性": "魔法",
        "范围": "近战",
        "伤害": "d8+4",
        "负荷": "单手",
        "特性": "恐惧: 成功的攻击同时会额外**标记 1 压力点**"
    },
    {
        "名称": "异界之锤",
        "原名": "Hammer of Exota",
        "检定": "本能",
        "属性": "魔法",
        "范围": "近战",
        "伤害": "d8+6",
        "负荷": "双手",
        "特性": "爆发: 当你在近战中击中一个生物时，每个邻近的敌人都必须进行反应掷骰（14），否则也会受到一半的伤害"
    },
    {
        "名称": "尤塔里血弓",
        "原名": "Yutari Bloodbow",
        "检定": "灵巧",
        "属性": "魔法",
        "范围": "远距离",
        "伤害": "d6+4",
        "负荷": "双手",
        "特性": "残暴: 伤害骰每掷出一次最大值，就额外掷出一个伤害骰"
    },
    {
        "名称": "长者之弓",
        "原名": "Elder Bow",
        "检定": "本能",
        "属性": "魔法",
        "范围": "远距离",
        "伤害": "d6+4",
        "负荷": "双手",
        "特性": "强力: 额外骰一个伤害骰并去掉其中最小的一个"
    },
    {
        "名称": "伊利亚斯的权杖",
        "原名": "Scepter of Elias",
        "检定": "风度",
        "属性": "魔法",
        "范围": "远距离",
        "伤害": "d6+3",
        "负荷": "单手",
        "特性": "振奋: 当你成功攻击时，掷一个 d4。掷出 4 时，**清除 1 压力点**"
    },
    {
        "名称": "迷惑魔杖",
        "原名": "Wand of Enthrallment",
        "检定": "风度",
        "属性": "魔法",
        "范围": "远距离",
        "伤害": "d6+4",
        "负荷": "单手",
        "特性": "说服: 在进行风度掷骰前可**标记 1 压力点**以+2"
    },
    {
        "名称": "看守者之杖",
        "原名": "Keeper's Staff",
        "检定": "知识",
        "属性": "魔法",
        "范围": "远距离",
        "伤害": "d6+4",
        "负荷": "双手",
        "特性": "可靠: 你的攻击掷骰+1"
    }
];

const weapon_t3_physics = [
    {
        "名称": "高级阔剑",
        "原名": "Advanced Broadsword",
        "检定": "敏捷",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8+6",
        "负荷": "单手",
        "特性": "可靠: 你的攻击掷骰+1"
    },
    {
        "名称": "高级长剑",
        "原名": "Advanced Longsword",
        "检定": "敏捷",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8+9",
        "负荷": "双手",
        "特性": ""
    },
    {
        "名称": "高级战斧",
        "原名": "Advanced Battleaxe",
        "检定": "力量",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d10+9",
        "负荷": "双手",
        "特性": ""
    },
    {
        "名称": "高级巨剑",
        "原名": "Advanced Greatsword",
        "检定": "力量",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d10+9",
        "负荷": "双手",
        "特性": "巨型: 闪避值-1，额外骰一个伤害骰并去掉其中最小的一个"
    },
    {
        "名称": "高级钉头锤",
        "原名": "Advanced Mace",
        "检定": "力量",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8+7",
        "负荷": "单手",
        "特性": ""
    },
    {
        "名称": "高级战锤",
        "原名": "Advanced Warhammer",
        "检定": "力量",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d12+9",
        "负荷": "双手",
        "特性": "重型: 闪避值-1"
    },
    {
        "名称": "高级匕首",
        "原名": "Advanced Dagger",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8+7",
        "负荷": "单手",
        "特性": ""
    },
    {
        "名称": "高级短棍",
        "原名": "Advanced Quarterstaff",
        "检定": "本能",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d10+9",
        "负荷": "双手",
        "特性": ""
    },
    {
        "名称": "高级短刀",
        "原名": "Advanced Cutlass",
        "检定": "风度",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8+7",
        "负荷": "单手",
        "特性": ""
    },
    {
        "名称": "高级刺剑",
        "原名": "Advanced Rapier",
        "检定": "风度",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8+6",
        "负荷": "单手",
        "特性": "迅捷: **标记 1 压力点**以额外攻击一个范围内的目标"
    },
    {
        "名称": "高级戟",
        "原名": "Advanced Halberd",
        "检定": "力量",
        "属性": "物理",
        "范围": "邻近",
        "伤害": "d10+8",
        "负荷": "双手",
        "特性": "繁琐: 灵巧-1"
    },
    {
        "名称": "高级长矛",
        "原名": "Advanced Spear",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "邻近",
        "伤害": "d10+8",
        "负荷": "双手",
        "特性": "繁琐: 灵巧-1"
    },
    {
        "名称": "高级短弓",
        "原名": "Advanced Shortbow",
        "检定": "敏捷",
        "属性": "物理",
        "范围": "远距离",
        "伤害": "d6+9",
        "负荷": "双手",
        "特性": ""
    },
    {
        "名称": "高级弩",
        "原名": "Advanced Crossbow",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "远距离",
        "伤害": "d6+7",
        "负荷": "单手",
        "特性": ""
    },
    {
        "名称": "高级长弓",
        "原名": "Advanced Longbow",
        "检定": "敏捷",
        "属性": "物理",
        "范围": "极远",
        "伤害": "d8+9",
        "负荷": "双手",
        "特性": "繁琐: 灵巧-1"
    },
    {
        "名称": "闪蝶之刃",
        "原名": "Flickerfly Blade",
        "检定": "敏捷",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8+5",
        "负荷": "单手",
        "特性": "锐翼: 将你的敏捷属性值添加到该武器的伤害掷骰中"
    },
    {
        "名称": "勇气之剑",
        "原名": "Bravesword",
        "检定": "力量",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d12+7",
        "负荷": "双手",
        "特性": "勇气: 闪避值 -1 ，严重伤害阈值 +3"
    },
    {
        "名称": "愤怒之锤",
        "原名": "Hammer of Wrath",
        "检定": "力量",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d10+7",
        "负荷": "双手",
        "特性": "毁灭: 在攻击掷骰之前**标记压力点**，在进行伤害掷骰时，把你的伤害骰改为d20"
    },
    {
        "名称": "拉布里斯斧",
        "原名": "Labrys Axe",
        "检定": "力量",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d10+7",
        "负荷": "双手",
        "特性": "保护: 护甲值+1"
    },
    {
        "名称": "经络短刀",
        "原名": "Meridian Cutlass",
        "检定": "风度",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d10+5",
        "负荷": "单手",
        "特性": "决斗: 当近距离内除了当前目标外没有其他生物时，攻击掷骰时获得优势"
    },
    {
        "名称": "伸缩军刀",
        "原名": "Retractable Saber",
        "检定": "风度",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d10+7",
        "负荷": "单手",
        "特性": "伸缩: 刀片可以隐藏在刀柄中以避免被识别为武器"
    },
    {
        "名称": "双连枷",
        "原名": "Double Flail",
        "检定": "敏捷",
        "属性": "物理",
        "范围": "邻近",
        "伤害": "d10+8",
        "负荷": "双手",
        "特性": "强力: 额外骰一个伤害骰并去掉其中最小的一个"
    },
    {
        "名称": "利爪之刃",
        "原名": "Talon Blades",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "近距离",
        "伤害": "d10+7",
        "负荷": "双手",
        "特性": "残暴: 伤害骰每掷出一次最大值，就额外掷出一个伤害骰"
    },
    {
        "名称": "黑火药左轮",
        "原名": "Black Powder Revolver",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "远距离",
        "伤害": "d6+8",
        "负荷": "单手",
        "特性": "装填: 攻击后骰1d6，如果骰出1，下次攻击前你必须**标记 1 压力点**进行装填"
    },
    {
        "名称": "尖刺弓",
        "原名": "Spiked Bow",
        "检定": "敏捷",
        "属性": "物理",
        "范围": "极远",
        "伤害": "d6+7",
        "负荷": "双手",
        "特性": "多用：这把武器也可以按这些属性使用 - 敏捷近战d10+5"
    }
];

const weapon_t3_magic = [
    {
        "名称": "高级奥术护手",
        "原名": "Advanced Arcane Gauntlets",
        "检定": "力量",
        "属性": "魔法",
        "范围": "近战",
        "伤害": "d10+9",
        "负荷": "双手",
        "特性": ""
    },
    {
        "名称": "高级圣斧",
        "原名": "Advanced Hallowed Axe",
        "检定": "力量",
        "属性": "魔法",
        "范围": "近战",
        "伤害": "d8+7",
        "负荷": "单手",
        "特性": ""
    },
    {
        "名称": "高级发光戒指",
        "原名": "Advanced Glowing Rings",
        "检定": "敏捷",
        "属性": "魔法",
        "范围": "邻近",
        "伤害": "d10+8",
        "负荷": "双手",
        "特性": ""
    },
    {
        "名称": "高级手持符文",
        "原名": "Advanced Hand Runes",
        "检定": "本能",
        "属性": "魔法",
        "范围": "邻近",
        "伤害": "d10+6",
        "负荷": "单手",
        "特性": ""
    },
    {
        "名称": "高级回力剑",
        "原名": "Advanced Returing Blade",
        "检定": "灵巧",
        "属性": "魔法",
        "范围": "近距离",
        "伤害": "d8+6",
        "负荷": "单手",
        "特性": "回力：当此武器在射程内被投掷后，会在完成攻击的瞬间重新出现在你手中。"
    },
    {
        "名称": "高级短杖",
        "原名": "Shortstaff",
        "检定": "本能",
        "属性": "魔法",
        "范围": "近距离",
        "伤害": "d8+7",
        "负荷": "单手",
        "特性": ""
    },
    {
        "名称": "高级双手法杖",
        "原名": "Advanced Dualstaff",
        "检定": "本能",
        "属性": "魔法",
        "范围": "远距离",
        "伤害": "d6+9",
        "负荷": "双手",
        "特性": ""
    },
    {
        "名称": "高级权杖",
        "原名": "Advanced Scepter",
        "检定": "风度",
        "属性": "魔法",
        "范围": "远距离",
        "伤害": "d6+6",
        "负荷": "双手",
        "特性": "多用：这把武器也可以按这些属性使用 - 本能近战d8+4"
    },
    {
        "名称": "高级魔杖",
        "原名": "Advanced Wand",
        "检定": "知识",
        "属性": "魔法",
        "范围": "远距离",
        "伤害": "d6+7",
        "负荷": "单手",
        "特性": ""
    },
    {
        "名称": "高级巨杖",
        "原名": "Advanced Greatstaff",
        "检定": "知识",
        "属性": "魔法",
        "范围": "极远",
        "伤害": "d6+6",
        "负荷": "双手",
        "特性": "强力: 额外骰一个伤害骰并去掉其中最小的一个"
    },
    {
        "名称": "运气之斧",
        "原名": "Axe of Fortunis",
        "检定": "力量",
        "属性": "魔法",
        "范围": "近战",
        "伤害": "d10+8",
        "负荷": "双手",
        "特性": "幸运: **花费 1 压力点**重骰一次失败的掷骰，并接受新的结果"
    },
    {
        "名称": "祝福匕首",
        "原名": "Blessed Anlace",
        "检定": "本能",
        "属性": "魔法",
        "范围": "近战",
        "伤害": "d10+6",
        "负荷": "单手",
        "特性": "治愈: 休息时间时，自动**恢复 1 生命点**"
    },
    {
        "名称": "鬼魂之刃",
        "原名": "Ghostblade",
        "检定": "风度",
        "属性": "物理/魔法",
        "范围": "近战",
        "伤害": "d10+7",
        "负荷": "单手",
        "特性": "异界: 你可以选择造成物理或者魔法伤害"
    },
    {
        "名称": "毁灭符文",
        "原名": "Runes of Ruination",
        "检定": "知识",
        "属性": "魔法",
        "范围": "邻近",
        "伤害": "d20+4",
        "负荷": "单手",
        "特性": "苦痛Painful: 每次你使用此武器成功攻击时，你需**标记 1 压力点**"
    },
    {
        "名称": "维多加斯特的吊坠",
        "原名": "Widogast Pendant",
        "检定": "知识",
        "属性": "魔法",
        "范围": "近距离",
        "伤害": "d10+5",
        "负荷": "单手",
        "特性": "时间扭曲者Timebender: 你可以在攻击掷骰后选择攻击目标"
    },
    {
        "名称": "鎏金弓",
        "原名": "Gilded Bow",
        "检定": "灵巧",
        "属性": "魔法",
        "范围": "远距离",
        "伤害": "d6+7",
        "负荷": "双手",
        "特性": "自省: 伤害掷骰中的所有1都视为6"
    },
    {
        "名称": "火焰杖",
        "原名": "Firestaff",
        "检定": "本能",
        "属性": "魔法",
        "范围": "远距离",
        "伤害": "d6+7",
        "负荷": "双手",
        "特性": "灼烧: 伤害掷骰中骰出的每个6都对目标**标记 1 压力点**"
    },
    {
        "名称": "法师球",
        "原名": "Mage Orb",
        "检定": "知识",
        "属性": "魔法",
        "范围": "远距离",
        "伤害": "d6+7",
        "负荷": "单手",
        "特性": "强力: 额外骰一个伤害骰并去掉其中最小的一个"
    },
    {
        "名称": "伊尔玛里的步枪",
        "原名": "llmari’s Rifle",
        "检定": "灵巧",
        "属性": "魔法",
        "范围": "极远",
        "伤害": "d6+6",
        "负荷": "单手",
        "特性": "装填: 攻击后骰1d6，如果骰出1，下次攻击前你必须**标记 1 压力点**进行装填"
    }
];

const weapon_t4_physics = [
    {
        "名称": "传奇阔剑",
        "原名": "Legendary Broadsword",
        "检定": "敏捷",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8+9",
        "负荷": "单手",
        "特性": "可靠: 你的攻击掷骰+1"
    },
    {
        "名称": "传奇长剑",
        "原名": "Legendary Longsword",
        "检定": "敏捷",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8+12",
        "负荷": "双手",
        "特性": ""
    },
    {
        "名称": "传奇战斧",
        "原名": "Legendary Battleaxe",
        "检定": "力量",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d10+12",
        "负荷": "双手",
        "特性": ""
    },
    {
        "名称": "传奇巨剑",
        "原名": "Legendary Greatsword",
        "检定": "力量",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d10+12",
        "负荷": "双手",
        "特性": "巨型: 闪避值-1，额外骰一个伤害骰并去掉其中最小的一个"
    },
    {
        "名称": "传奇钉头锤",
        "原名": "Legendary Mace",
        "检定": "力量",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8+10",
        "负荷": "单手",
        "特性": ""
    },
    {
        "名称": "传奇战锤",
        "原名": "Legendary Warhammer",
        "检定": "力量",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d12+12",
        "负荷": "双手",
        "特性": "重型: 闪避值-1"
    },
    {
        "名称": "传奇匕首",
        "原名": "Legendary Dagger",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8+10",
        "负荷": "单手",
        "特性": ""
    },
    {
        "名称": "传奇短棍",
        "原名": "Legendary Quarterstaff",
        "检定": "本能",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d10+12",
        "负荷": "双手",
        "特性": ""
    },
    {
        "名称": "传奇短刀",
        "原名": "Legendary Cutlass",
        "检定": "风度",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8+10",
        "负荷": "单手",
        "特性": ""
    },
    {
        "名称": "传奇刺剑",
        "原名": "Legendary Rapier",
        "检定": "风度",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8+9",
        "负荷": "单手",
        "特性": "迅捷: **标记 1 压力点**以额外攻击一个范围内的目标"
    },
    {
        "名称": "传奇戟",
        "原名": "Legendary Halberd",
        "检定": "力量",
        "属性": "物理",
        "范围": "邻近",
        "伤害": "d10+11",
        "负荷": "双手",
        "特性": "繁琐: 灵巧-1"
    },
    {
        "名称": "传奇长矛",
        "原名": "Legendary Spear",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "邻近",
        "伤害": "d10+11",
        "负荷": "双手",
        "特性": "繁琐: 灵巧-1"
    },
    {
        "名称": "传奇短弓",
        "原名": "Legendary Shortbow",
        "检定": "敏捷",
        "属性": "物理",
        "范围": "远距离",
        "伤害": "d6+12",
        "负荷": "双手",
        "特性": ""
    },
    {
        "名称": "传奇弩",
        "原名": "Legendary Crossbow",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "远距离",
        "伤害": "d6+10",
        "负荷": "单手",
        "特性": ""
    },
    {
        "名称": "传奇长弓",
        "原名": "Legendary Longbow",
        "检定": "敏捷",
        "属性": "物理",
        "范围": "极远",
        "伤害": "d8+12",
        "负荷": "双手",
        "特性": "繁琐: 灵巧-1"
    },
    {
        "名称": "双刃剑",
        "原名": "Dual-Ended Sword",
        "检定": "敏捷",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d10+9",
        "负荷": "双手",
        "特性": "迅捷: **标记 1 压力点**以额外攻击一个范围内的目标"
    },
    {
        "名称": "冲击拳套",
        "原名": "Impact Gauntlet",
        "检定": "力量",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d10+11",
        "负荷": "单手",
        "特性": "震荡: 在一次成功攻击后**花费 1 希望点**，将目标击退至远距离"
    },
    {
        "名称": "巨斧",
        "原名": "Sledge Axe",
        "检定": "力量",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d12+13",
        "负荷": "双手",
        "特性": "破坏: 敏捷-1，成功攻击后为所有邻近范围内的敌人**标记 1 压力点**"
    },
    {
        "名称": "弧形匕首",
        "原名": "Curved Dagger",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8+9",
        "负荷": "单手",
        "特性": "锯齿: 伤害骰中的1皆视为8点伤害"
    },
    {
        "名称": "延伸长柄武器",
        "原名": "Extended Polearm",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "邻近",
        "伤害": "d8+10",
        "负荷": "双手",
        "特性": "延长: 你能够将范围内所有处于一条直线上的敌人同时作为你的攻击目标"
    },
    {
        "名称": "摆动绳刃",
        "原名": "Swinging Ropeblade",
        "检定": "风度",
        "属性": "物理",
        "范围": "近距离",
        "伤害": "d8+9",
        "负荷": "双手",
        "特性": "捕获: 在一次成功攻击后**花费 1 希望点**，使目标陷入束缚状态或者将其拉至你的近战范围"
    },
    {
        "名称": "弹跳斧",
        "原名": "Ricochet Axes",
        "检定": "敏捷",
        "属性": "物理",
        "范围": "远距离",
        "伤害": "d6+11",
        "负荷": "双手",
        "特性": "弹跳: 标记任意压力点，可同时攻击范围内等量的敌人"
    },
    {
        "名称": "安塔利弓",
        "原名": "Aantari Bow",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "远距离",
        "伤害": "d6+11",
        "负荷": "双手",
        "特性": "可靠: 你的攻击掷骰+1"
    },
    {
        "名称": "手炮",
        "原名": "Hand Cannon",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "极远",
        "伤害": "d6+12",
        "负荷": "单手",
        "特性": "装填: 攻击后骰1d6，如果骰出1，下次攻击前你必须**标记 1 压力点**进行装填"
    }
];

const weapon_t4_magic = [
    {
        "名称": "传奇奥术护手",
        "原名": "Legendary Arcane Gauntlets",
        "检定": "力量",
        "属性": "魔法",
        "范围": "近战",
        "伤害": "d10+12",
        "负荷": "双手",
        "特性": ""
    },
    {
        "名称": "传奇圣斧",
        "原名": "Legendary Hallowed Axe",
        "检定": "力量",
        "属性": "魔法",
        "范围": "近战",
        "伤害": "d8+10",
        "负荷": "单手",
        "特性": ""
    },
    {
        "名称": "传奇发光戒指",
        "原名": "Legendary Glowing Rings",
        "检定": "敏捷",
        "属性": "魔法",
        "范围": "邻近",
        "伤害": "d10+11",
        "负荷": "双手",
        "特性": ""
    },
    {
        "名称": "传奇手持符文",
        "原名": "Legendary Hand Runes",
        "检定": "本能",
        "属性": "魔法",
        "范围": "邻近",
        "伤害": "d10+9",
        "负荷": "单手",
        "特性": ""
    },
    {
        "名称": "传奇回力剑",
        "原名": "Legendary Returing Blade",
        "检定": "灵巧",
        "属性": "魔法",
        "范围": "近距离",
        "伤害": "d8+9",
        "负荷": "单手",
        "特性": "回力：当此武器在射程内被投掷后，会在完成攻击的瞬间重新出现在你手中。"
    },
    {
        "名称": "传奇短杖",
        "原名": "Shortstaff",
        "检定": "本能",
        "属性": "魔法",
        "范围": "近距离",
        "伤害": "d8+10",
        "负荷": "单手",
        "特性": ""
    },
    {
        "名称": "传奇双手法杖",
        "原名": "Legendary Dualstaff",
        "检定": "本能",
        "属性": "魔法",
        "范围": "远距离",
        "伤害": "d8+12",
        "负荷": "双手",
        "特性": ""
    },
    {
        "名称": "传奇权杖",
        "原名": "Legendary Scepter",
        "检定": "风度",
        "属性": "魔法",
        "范围": "远距离",
        "伤害": "d6+9",
        "负荷": "双手",
        "特性": "多用：这把武器也可以按这些属性使用 - 本能近战d8+6"
    },
    {
        "名称": "传奇魔杖",
        "原名": "Legendary Wand",
        "检定": "知识",
        "属性": "魔法",
        "范围": "远距离",
        "伤害": "d6+10",
        "负荷": "单手",
        "特性": ""
    },
    {
        "名称": "传奇巨杖",
        "原名": "Legendary Greatstaff",
        "检定": "知识",
        "属性": "魔法",
        "范围": "极远",
        "伤害": "d6+9",
        "负荷": "双手",
        "特性": "强力: 额外骰一个伤害骰并去掉其中最小的一个"
    },
    {
        "名称": "光焰剑",
        "原名": "Sword of Light&Flame",
        "检定": "力量",
        "属性": "魔法",
        "范围": "近战",
        "伤害": "d10+11",
        "负荷": "双手",
        "特性": "烧融: 可以切开坚固的材质"
    },
    {
        "名称": "虹吸拳套",
        "原名": "Siphoning Gauntlets",
        "检定": "风度",
        "属性": "魔法",
        "范围": "近战",
        "伤害": "d10+9",
        "负荷": "双手",
        "特性": "系命: 在一次成功攻击后骰1d6，如果骰出6则**恢复 1 生命点**或**清除 1 压力点**"
    },
    {
        "名称": "迈达斯镰刀",
        "原名": "Midas Scythe",
        "检定": "知识",
        "属性": "魔法",
        "范围": "近战",
        "伤害": "d10+9",
        "负荷": "双手",
        "特性": "贪婪: 你可以花费一把金币，使你的伤害掷骰熟练+1"
    },
    {
        "名称": "漂浮碎刃",
        "原名": "Floating Bladeshards",
        "检定": "本能",
        "属性": "魔法",
        "范围": "近距离",
        "伤害": "d8+9",
        "负荷": "单手",
        "特性": "强力: 额外骰一个伤害骰并去掉其中最小的一个"
    },
    {
        "名称": "血杖",
        "原名": "Bloodstaff",
        "检定": "本能",
        "属性": "魔法",
        "范围": "远距离",
        "伤害": "d20+7",
        "负荷": "双手",
        "特性": "苦痛: 每次你使用此武器攻击时，你需**标记 1 压力点**"
    },
    {
        "名称": "蓟弓",
        "原名": "Thistlebow",
        "检定": "本能",
        "属性": "魔法",
        "范围": "远距离",
        "伤害": "d6+13",
        "负荷": "双手",
        "特性": "可靠: 你的攻击掷骰+1"
    },
    {
        "名称": "埃塞克之杖",
        "原名": "Wand of Essek",
        "检定": "知识",
        "属性": "魔法",
        "范围": "远距离",
        "伤害": "d8+13",
        "负荷": "单手",
        "特性": "时间扭曲者: 你可以在攻击掷骰后选择攻击目标"
    },
    {
        "名称": "魔战士左轮",
        "原名": "Magus Revolver",
        "检定": "灵巧",
        "属性": "魔法",
        "范围": "极远",
        "伤害": "d6+13",
        "负荷": "单手",
        "特性": "装填: 攻击后骰1d6，如果骰出1，下次攻击前你必须**标记 1 压力点**进行装填"
    },
    {
        "名称": "融合手套",
        "原名": "Fusion Gloves",
        "检定": "知识",
        "属性": "魔法",
        "范围": "极远",
        "伤害": "d6+9",
        "负荷": "双手",
        "特性": "绑定: 将你的等级数添加到伤害掷骰中"
    }
];



const offhand_weapon_t1 = [
    {
        "名称": "短剑",
        "原名": "Shortsword",
        "检定": "敏捷",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8",
        "负荷": "副手",
        "特性": "双持: 近战时主武器伤害 +2"
    },
    {
        "名称": "圆盾",
        "原名": "Round Shield",
        "检定": "力量",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d4",
        "负荷": "副手",
        "特性": "保护: 护甲值+1"
    },
    {
        "名称": "塔盾",
        "原名": "Tower Shield",
        "检定": "力量",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d6",
        "负荷": "副手",
        "特性": "壁垒：+2 护甲值，-1 闪避值"
    },
    {
        "名称": "小匕首",
        "原名": "Small Dagger",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8",
        "负荷": "副手",
        "特性": "双持: 近战时主武器伤害 +2"
    },
    {
        "名称": "鞭子",
        "原名": "Whip",
        "检定": "风度",
        "属性": "物理",
        "范围": "邻近",
        "伤害": "d6",
        "负荷": "副手",
        "特性": "鞭笞: **标记 1 压力点**，将所有近战范围内的敌人击退至近距离"
    },
    {
        "名称": "抓钩",
        "原名": "Grappler",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "近距离",
        "伤害": "d6",
        "负荷": "副手",
        "特性": "出钩: 进行一次成功的攻击后，你可以将目标拉至你的近战范围内"
    },
    {
        "名称": "手弩",
        "原名": "Hand Crossbow",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "远距离",
        "伤害": "d6+1",
        "负荷": "副手",
        "特性": ""
    }
];
const offhand_weapon_t2 = [
    {
        "名称": "改良短剑",
        "原名": "Improved Shortsword",
        "检定": "敏捷",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8+2",
        "负荷": "副手",
        "特性": "双持: 近战时主武器伤害+3"
    },
    {
        "名称": "改良圆盾",
        "原名": "Improved Round Shield",
        "检定": "力量",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d4+2",
        "负荷": "副手",
        "特性": "保护: 护甲值+2"
    },
    {
        "名称": "改良塔盾",
        "原名": "Improved Tower Shield",
        "检定": "力量",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d6+2",
        "负荷": "副手",
        "特性": "壁垒: 护甲值+3，闪避值-1"
    },
    {
        "名称": "改良小匕首",
        "原名": "Improved Small Dagger",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8+2",
        "负荷": "副手",
        "特性": "双持: 近战时主武器伤害 +3"
    },    
    {
        "名称": "改良鞭子",
        "原名": "Improved Whip",
        "检定": "风度",
        "属性": "物理",
        "范围": "邻近",
        "伤害": "d6+2",
        "负荷": "副手",
        "特性": "鞭笞: **标记 1 压力点**，将所有近战范围内的敌人击退至近距离"
    },
    {
        "名称": "改良抓钩",
        "原名": "Improved Grappler",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "近距离",
        "伤害": "d6+2",
        "负荷": "副手",
        "特性": "出钩: 进行一次成功的攻击后，你可以将目标拉至你的近战范围内"
    },
    {
        "名称": "改良手弩",
        "原名": "Improved Hand Crossbow",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "远距离",
        "伤害": "d6+3",
        "负荷": "副手",
        "特性": ""
    },
    {
        "名称": "尖刺盾牌",
        "原名": "Spiked Shield",
        "检定": "力量",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d6+2",
        "负荷": "副手",
        "特性": "两用: 护甲值+1，近战时主武器伤害+1"
    },
    {
        "名称": "格挡匕首",
        "原名": "Parrying Dagger",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d6+2",
        "负荷": "副手",
        "特性": "格挡: 在你被攻击时，掷出该武器的伤害骰子。如果有任何与攻击者匹配的骰子，则在伤害总计之前将其移除"
    },
    {
        "名称": "回力斧",
        "原名": "Returning Axe",
        "检定": "敏捷",
        "属性": "物理",
        "范围": "近距离",
        "伤害": "d6+4",
        "负荷": "副手",
        "特性": "回力：当此武器在射程内被投掷后，会在完成攻击的瞬间重新出现在你手中。"
    }
];
const offhand_weapon_t3 = [
    {
        "名称": "高级短剑",
        "原名": "Advanced Shortsword",
        "检定": "敏捷",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8+4",
        "负荷": "副手",
        "特性": "双持: 近战时主武器伤害+4"
    },
    {
        "名称": "高级圆盾",
        "原名": "Advanced Round Shield",
        "检定": "力量",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d4+4",
        "负荷": "副手",
        "特性": "保护: 护甲值+3"
    },
    {
        "名称": "高级塔盾",
        "原名": "Advanced Tower Shield",
        "检定": "力量",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d6+4",
        "负荷": "副手",
        "特性": "壁垒r: 护甲值+4，闪避值-1"
    },
    {
        "名称": "高级小匕首",
        "原名": "Advanced Small Dagger",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8+4",
        "负荷": "副手",
        "特性": "双持: 近战时主武器伤害+4"
    },    
    {
        "名称": "高级鞭子",
        "原名": "Advanced Whip",
        "检定": "风度",
        "属性": "物理",
        "范围": "邻近",
        "伤害": "d6+4",
        "负荷": "副手",
        "特性": "鞭笞: **标记 1 压力点**，将所有近战范围内的敌人击退至近距离"
    },
    {
        "名称": "高级抓钩",
        "原名": "AdvancedGrappler",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "近距离",
        "伤害": "d6+4",
        "负荷": "副手",
        "特性": "出钩: 进行一次成功的攻击后，你可以将目标拉至你的近战范围内"
    },
    {
        "名称": "高级手弩",
        "原名": "AdvancedHand Crossbow",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "远距离",
        "伤害": "d6+5",
        "负荷": "副手",
        "特性": ""
    },
    {
        "名称": "小盾",
        "原名": "Buckler",
        "检定": "敏捷",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d4+4",
        "负荷": "副手",
        "特性": "反射: 面对即将到来的攻击时，你可以**花费 1 护甲槽**，将你的护甲值数值添加到你的闪避值中"
    },
    {
        "名称": "强力拳套",
        "原名": "Powered Gauntlet",
        "检定": "知识",
        "属性": "物理",
        "范围": "近距离",
        "伤害": "d6+4",
        "负荷": "副手",
        "特性": "充能攻击: **标记 1 压力点**，为主要武器的攻击熟练+1"
    },
    {
        "名称": "弹弓",
        "原名": "Hand Sling",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "极远",
        "伤害": "d6+4",
        "负荷": "副手",
        "特性": "多用：这把武器也可以按这些属性使用 - 灵巧近距离d8+4"
    }
];
const offhand_weapon_t4 = [
    {
        "名称": "传奇短剑",
        "原名": "Legendary Shortsword",
        "检定": "敏捷",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8+6",
        "负荷": "副手",
        "特性": "双持: 近战时主武器伤害+5"
    },
    {
        "名称": "传奇圆盾",
        "原名": "Legendary Round Shield",
        "检定": "力量",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d4+6",
        "负荷": "副手",
        "特性": "保护: 护甲值+4"
    },
    {
        "名称": "传奇塔盾",
        "原名": "Legendary Tower Shield",
        "检定": "力量",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d6+6",
        "负荷": "副手",
        "特性": "壁垒r: 护甲值+5，闪避值-1"
    },
    {
        "名称": "传奇小匕首",
        "原名": "Legendary Small Dagger",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d8+6",
        "负荷": "副手",
        "特性": "双持: 近战时主武器伤害+5"
    },
    {
        "名称": "传奇鞭子",
        "原名": "Legendary Whip",
        "检定": "风度",
        "属性": "物理",
        "范围": "邻近",
        "伤害": "d6+6",
        "负荷": "副手",
        "特性": "鞭笞: **标记 1 压力点**，将所有近战范围内的敌人击退至近距离"
    },
    {
        "名称": "传奇抓钩",
        "原名": "Legendary Grappler",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "近距离",
        "伤害": "d6+6",
        "负荷": "副手",
        "特性": "出钩: 进行一次成功的攻击后，你可以将目标拉至你的近战范围内"
    },
    {
        "名称": "传奇手弩",
        "原名": "Legendary Hand Crossbow",
        "检定": "灵巧",
        "属性": "物理",
        "范围": "远距离",
        "伤害": "d6+7",
        "负荷": "副手",
        "特性": ""
    },
    {
        "名称": "勇气之盾",
        "原名": "Braveshield",
        "检定": "敏捷",
        "属性": "物理",
        "范围": "近战",
        "伤害": "d4+6",
        "负荷": "副手",
        "特性": "庇护：当你**标记 1 护甲槽**时，它将为你和所有近战范围内受到同源伤害的盟友减免伤害。"
    },
    {
        "名称": "拳爪",
        "原名": "Kunckle Claws",
        "检定": "力量",
        "属性": "魔法",
        "范围": "近战",
        "伤害": "d6+8",
        "负荷": "副手",
        "特性": "双击: 当你使用主要武器进行一次攻击后，你可以同时使用此武器对另一名近战范围内的敌人造成伤害"
    },
    {
        "名称": "引物碎片",
        "原名": "Primer Shard",
        "检定": "本能",
        "属性": "物理",
        "范围": "邻近",
        "伤害": "d4",
        "负荷": "副手",
        "特性": "锁定: 使用此武器对成功攻击一名敌人后，你的主武器对其的下一次攻击将自动命中"
    }
];

const armor_t1 = [
    {
        "名称": "填充布甲",
        "原名": "Gambeson Armor",
        "护甲值": "3",
        "阈值": ["5","11"],
        "特性": "灵活: 闪避值+1"
    },
    {
        "名称": "皮甲",
        "原名": "Leather Armor",
        "护甲值": "3",
        "阈值": ["6","13"],
        "特性": ""
    },
    {
        "名称": "链甲",
        "原名": "Chainmail Armor",
        "护甲值": "4",
        "阈值": ["7","15"],
        "特性": "重型: 闪避值-1"
    },
    {
        "名称": "全板甲",
        "原名": "Full Plate Armor",
        "护甲值": "4",
        "阈值": ["8","17"],
        "特性": "极重: 闪避值-2，敏捷-1"
    }
];
const armor_t2 = [
    {
        "名称": "改良填充布甲",
        "原名": "Improved Gambeson Armor",
        "护甲值": "4",
        "阈值": ["7","16"],
        "特性": "灵活: 闪避值+1"
    },
    {
        "名称": "改良皮甲",
        "原名": "Improved Leather Armor",
        "护甲值": "4",
        "阈值": ["9","20"],
        "特性": ""
    },
    {
        "名称": "改良链甲",
        "原名": "Improved Chainmail Armor",
        "护甲值": "5",
        "阈值": ["11","24"],
        "特性": "重型: 闪避值-1"
    },
    {
        "名称": "改良全板甲",
        "原名": "Improved Full Plate Armor",
        "护甲值": "5",
        "阈值": ["13","28"],
        "特性": "极重: 闪避值-2，敏捷-1"
    },
    {
        "名称": "埃伦德里安链甲",
        "原名": "Elundrian Chain Armor",
        "护甲值": "4",
        "阈值": ["9","21"],
        "特性": "防护：受魔法伤害时，在计算伤害阈值前按护甲值减免伤害。"
    },
    {
        "名称": "掠骸护甲",
        "原名": "Harrowbone Armor",
        "护甲值": "4",
        "阈值": ["9","21"],
        "特性": "坚韧：在标记最后一个护甲槽之前，掷一个 d6。如果掷出6，则可以降低伤害一个等级而无需标记槽位。"
    },
    {
        "名称": "铁木胸甲",
        "原名": "Irontree Breastplate Armor",
        "护甲值": "4",
        "阈值": ["9","20"],
        "特性": "强化：当你标记最后一个护甲槽时，你的伤害阈值提升+2，直至你清除至少1个护甲槽。"
    },
    {
        "名称": "符文浮甲",
        "原名": "Runetan Floating Armor",
        "护甲值": "4",
        "阈值": ["9","20"],
        "特性": "转移：当你成为攻击目标时，可以**标记 1 护甲槽*，使针对你的攻击检定具有劣势"
    },
    {
        "名称": "泰瑞斯软甲",
        "原名": "Tyris Soft Armor",
        "护甲值": "5",
        "阈值": ["8","18"],
        "特性": "安静: 任何试图不被人听到的移动动作掷骰 +2"
    },
    {
        "名称": "蔷薇野甲",
        "原名": "Rosewild Armor",
        "护甲值": "5",
        "阈值": ["11","23"],
        "特性": "希冀: 每当你需要**花费希望点**时，你可以改为**标记护甲槽**"
    }
];
const armor_t3 = [
    {
        "名称": "高级填充布甲",
        "原名": "Advanced Gambeson Armor",
        "护甲值": "5",
        "阈值": ["9","23"],
        "特性": "灵活: 闪避值+1"
    },
    {
        "名称": "高级皮甲",
        "原名": "Advanced Leather Armor",
        "护甲值": "5",
        "阈值": ["11","27"],
        "特性": ""
    },
    {
        "名称": "高级链甲",
        "原名": "Advanced Chainmail Armor",
        "护甲值": "6",
        "阈值": ["13","31"],
        "特性": "重型: 闪避值-1"
    },
    {
        "名称": "高级全板甲",
        "原名": "Advanced Full Plate Armor",
        "护甲值": "6",
        "阈值": ["15","35"],
        "特性": "极重: 闪避值-2，敏捷-1"
    },
    {
        "名称": "贝拉莫伊精致护甲",
        "原名": "Bellamoi Fine Armor",
        "护甲值": "5",
        "阈值": ["11","27"],
        "特性": "鎏金: 风度+1"
    },
    {
        "名称": "龙鳞护甲",
        "原名": "Dragonscale Armor",
        "护甲值": "5",
        "阈值": ["11","27"],
        "特性": "坚不可摧: 每短休一次，当你的生命值即将归零时，你可以改为**标记 1 压力点**。"
    },
    {
        "名称": "尖刺护甲",
        "原名": "Spiked Plate Armor",
        "护甲值": "5",
        "阈值": ["10","25"],
        "特性": "锋利: 每当你成功进行近战攻击时，伤害骰加1d4"
    },
    {
        "名称": "剑刃护甲",
        "原名": "Bladefare Armor",
        "护甲值": "6",
        "阈值": ["16","39"],
        "特性": "物理防御: 你不能使用此护甲抵消魔法伤害"
    },
    {
        "名称": "莫奈特的斗篷",
        "原名": "Monett’s Cloak",
        "护甲值": "6",
        "阈值": ["16","39"],
        "特性": "魔法防御: 你不能使用此护甲抵消物理伤害"
    },
    {
        "名称": "强化符文",
        "原名": "Runes of Fortification",
        "护甲值": "6",
        "阈值": ["17","43"],
        "特性": "苦痛: 每当你因受到攻击而标记1点或更多的护甲槽时，你需**标记 1 压力点**"
    }
];
const armor_t4 = [
    {
        "名称": "传奇填充布甲",
        "原名": "Legendary Gambeson Armor",
        "护甲值": "6",
        "阈值": ["11","32"],
        "特性": "灵活: 闪避值+1"
    },
    {
        "名称": "传奇皮甲",
        "原名": "Legendary Leather Armor",
        "护甲值": "6",
        "阈值": ["13","36"],
        "特性": ""
    },
    {
        "名称": "传奇链甲",
        "原名": "Legendary Chainmail Armor",
        "护甲值": "7",
        "阈值": ["15","40"],
        "特性": "重型: 闪避值-1"
    },
    {
        "名称": "传奇全板甲",
        "原名": "Legendary Full Plate Armor",
        "护甲值": "7",
        "阈值": ["17","44"],
        "特性": "极重: 闪避值-2，敏捷-1"
    },
    {
        "名称": "威能丝甲",
        "原名": "Dunamis Silkchain",
        "护甲值": "7",
        "阈值": ["13","36"],
        "特性": "时缓：标记一个护甲槽，投掷一枚d4骰子，并将结果作为闪避加值应用于对抗此次来袭攻击"
    },
    {
        "名称": "引导护甲",
        "原名": "Channeling Armor",
        "护甲值": "5",
        "阈值": ["13","36"],
        "特性": "引导: 当装备此护甲时，所有施法掷骰+1"
    },
    {
        "名称": "织烬护甲",
        "原名": "Emberwoven Armor",
        "护甲值": "6",
        "阈值": ["13","36"],
        "特性": "燃烧: 每当有敌人在近战范围内击中你时，他们立即**标记 1 压力点**"
    },
    {
        "名称": "全面强化护甲",
        "原名": "Full Reinforced Armor",
        "护甲值": "4",
        "阈值": ["15","40"],
        "特性": "坚毅：当你标记一个护甲槽时，可将攻击的严重程度降低两级而非一级"
    },
    {
        "名称": "诚实蛋白石护甲",
        "原名": "Veritas Opal Armor",
        "护甲值": "6",
        "阈值": ["13","36"],
        "特性": "求真: 当任何人在近距离范围内说谎时，此护甲将会发光"
    },
    {
        "名称": "救世主链甲",
        "原名": "Savior Chainmail",
        "护甲值": "8",
        "阈值": ["18","48"],
        "特性": "困难: 所有角色属性以及闪避值-1"
    }
];