const ITEMS_DATA = [
  { 
    "roll":  1, 
    "名称": "高级床单", 
    "原名": "Premium Bedroll", 
    "效果": "在任何休息期间，您总是会自动清除 1 个压力。"
  },
  { 
    "roll":  2, 
    "名称": "风笛哨", 
    "原名": "Piper Whistle", 
    "效果": "手工制作的哨子。每只哨子都有独特的声音，刺耳的声音在半径一英里的地方都能听到。"
  },
  { 
    "roll":  3, 
    "名称": "充能箭袋", 
    "原名": "Charging Quiver", 
    "效果": "当你使用此箭袋中的箭矢发动攻击并成功命中时，伤害掷骰获得等同于你当前层级(Tier)的加值。 "
  },
  { 
    "roll":  4, 
    "名称": "阿利斯泰尔的火炬", 
    "原名": "Alistair's Torch", 
    "效果": "一把可以随心所欲点亮的魔法火炬，它发出的光比看起来要远得多。它可以让洞穴充满光亮，让人感觉就像白天一样。"
  },
  { 
    "roll":  5, 
    "名称": "通话法球", 
    "原名": "Speaking Orbs", 
    "效果": "一对球体，任何持有它们的生物都可以在任意距离内相互交流。"
  },
  { 
    "roll":  6, 
    "名称": "手铐", 
    "原名": "Manacles", 
    "效果": "一副带有钥匙的可锁手铐。"
  },
  { 
    "roll":  7, 
    "名称": "奥术斗篷", 
    "原名": "Arcane Cloak", 
    "效果": "任何拥有施法能力的使用者穿着它时都可以随意调整其颜色、纹理和尺寸的斗篷。"
  },
  { 
    "roll":  8, 
    "名称": "编织网", 
    "原名": "Woven Net", 
    "效果": "你可以用这张网进行 灵巧检定 来捕捉小型生物。被网住的目标可通过成功的 攻击检定 （DC16）挣脱。"
  },
  { 
    "roll":  9, 
    "名称": "生火罐", 
    "原名": "Fire Jar", 
    "效果": "你可以倾倒此罐中奇异的液体来立即产生火焰。液体将在你完成长休后重新生成。"
  },
  { 
    "roll": 10, 
    "名称": "悬空之杖", 
    "原名": "Suspended Rod", 
    "效果": "这根刻有符文的扁平短棒被激活时会立即悬停在原地。在解除激活前，短棒将不受重力影响且无法移动，始终固定在原位。"
  },
  { 
    "roll": 11, 
    "名称": "魅力石", 
    "原名": "Glamor Stone", 
    "效果": "激活这颗卵石大小的宝石，可记录你所见之人的外貌。消耗1点希望值，便能以幻象形式将这副伪装神奇地复现在自己身上。"
  },
  { 
    "roll": 12, 
    "名称": "空箱子", 
    "原名": "Empty Chest", 
    "效果": "一个魔法箱子，即使里面有物品，看起来也是空的。主人可以在打开箱子时使用特定的单词、短语或其他触发条件来显示这些物品。"
  },
  { 
    "roll": 13, 
    "名称": "伙伴箱", 
    "原名": "Companion Case", 
    "效果": "用于携带小动物伙伴的箱子。当它们在里面时，箱子和里面的生物动物都不会受到任何伤害和负面魔法效果。"
  },
  { 
    "roll": 14, 
    "名称": "穿刺箭", 
    "原名": "Piercing Arrows", 
    "效果": "使用弓进行攻击时，你可以使用穿刺箭将你的熟练值添加到伤害掷骰中。每短休可使用 3 次。 〇 〇 〇"
  },
  { 
    "roll": 15, 
    "名称": "勇气石", 
    "原名": "Valorstone", 
    "效果": "附在盔甲上。为尚未具备以下功能的盔甲添加以下特性：坚韧Resilient在标记最后一个护甲槽之前，掷一个 d6。如果掷出6，则可以降低伤害一个等级而无需标记槽位"
  },
  { 
    "roll": 16, 
    "名称": "万能钥匙", 
    "原名": "Skeleton Key", 
    "效果": "使尝试打开锁着的门时的灵巧掷骰具有优势"
  },
  { 
    "roll": 17, 
    "名称": "奥术棱镜", 
    "原名": "Arcane Prism", 
    "效果": "将此棱镜置于指定位置并激活。其近距离范围内的所有盟友在施法检定上获得+1加值。激活期间棱镜不可移动。解除激活后，需完成一次长休才能再次启用。"
  },
  { 
    "roll": 18, 
    "名称": "小型耐力药水配方", 
    "原名": "Minor Stamina Potion Recipe", 
    "效果": "花费一次休息动作和动物骨骼来制作一瓶小型耐力药水。"
  },
  { 
    "roll": 19, 
    "名称": "小型生命药水配方", 
    "原名": "Minor Health Potion Recipe", 
    "效果": "花费一次休息动作和一瓶血液来制作一瓶小型生命药水。"
  },
  { 
    "roll": 20, 
    "名称": "归航罗盘", 
    "原名": "Homing Compasses", 
    "效果": "两个罗盘无论相距多远，都只能指向对方。"
  },
  { 
    "roll": 21, 
    "名称": "修正者精魂", 
    "原名": "Corrector Sprite", 
    "效果": "一只坐在你耳道弯曲处的小精灵，在战斗中低声说着有用的建议。每次短暂休息时，你都可以在攻击检定中获得一次优势。不要告诉他们你的真名。"
  },
  { 
    "roll": 22, 
    "名称": "壁虎手套", 
    "原名": "Gecko Gloves", 
    "效果": "您可以爬上垂直表面并穿过天花板。"
  },
  { 
    "roll": 23, 
    "名称": "博学守护者", 
    "原名": "Lorekeeper", 
    "效果": "存储最多三个敌对生物的名字。下次面对它们时，在针对它们的任何动作掷骰上获得 +1。"
  },
  { 
    "roll": 24, 
    "名称": "黑烟瓶配方", 
    "原名": "Vial of Darksmoke Recipe", 
    "效果": "在休息时间，花费一次休息动作并标记1点压力来制作一个黑烟瓶。"
  },
  { 
    "roll": 25, 
    "名称": "血石", 
    "原名": "Bloodstone", 
    "效果": "附在武器上。为尚未具备以下功能的武器添加以下特性：残暴Brutal 伤害骰每掷出一次最大值，就额外掷出一个伤害骰"
  },
  { 
    "roll": 26, 
    "名称": "巨石", 
    "原名": "Greatstone", 
    "效果": "附在武器上。为尚未具备以下功能的武器添加以下特性：强力Powerful 额外骰1个伤害骰并去掉其中最小的一个 "
  },
  { 
    "roll": 27, 
    "名称": "滑翔机", 
    "原名": "Glider", 
    "效果": "可以通过标记1点压力来展开的小型降落伞。它允许使用者从高处安全地滑翔到下面的地面。"
  },
  { 
    "roll": 28, 
    "名称": "寂静戒指", 
    "原名": "Ring of Silence", 
    "效果": "花费一个希望激活此戒指，直到你的下一次短休，你的脚步声是无声的。"
  },
  { 
    "roll": 29, 
    "名称": "镇静吊坠", 
    "原名": "Calming Pendant", 
    "效果": "如果你必须标记最后一个压力槽，请掷一个 d6。如果掷出 5+，则无需标记。"
  },
  { 
    "roll": 30, 
    "名称": "双用瓶", 
    "原名": "Dual Flask", 
    "效果": "可容纳两种不同液体的瓶子。侧面的小按钮可让饮用者在两种液体之间切换。"
  },
  { 
    "roll": 31, 
    "名称": "幻沙袋", 
    "原名": "Bag of Ficklesand", 
    "效果": "这是一小袋沙子，可以通过 风度掷骰（DC10）将其调整为比实际重量重得多或轻得多。您还可以通过灵巧掷骰（DC10）将沙子吹到对手的脸上，使他们暂时陷入脆弱。"
  },
  { 
    "roll": 32, 
    "名称": "抵抗戒指", 
    "原名": "Ring of Resistance", 
    "效果": "每长休一次，激活这枚戒指使即将到来的伤害减少一半"
  },
  { 
    "roll": 33, 
    "名称": "凤凰羽毛", 
    "原名": "Phoenix Feather", 
    "效果": "只要你拥有任意数量的凤凰羽毛，当你失去知觉并掷骰子查看是否选择留下伤痕时，骰子结果总是 +1"
  },
  { 
    "roll": 34, 
    "名称": "百宝箱", 
    "原名": "Box of Many Goods", 
    "效果": "一个只能每长休打开一次的小盒子。打开时，骰d12，如果你骰出1-6，盒子是空的；如果你骰出7-10，盒子里会随机出现一个常见消耗品；如果你骰出11-12，盒子里会随机出现两个常见消耗品。"
  },
  { 
    "roll": 35, 
    "名称": "空刃护符", 
    "原名": "Airblade Charm", 
    "效果": "附在近战武器上，使其能够在近距离范围内攻击。每短休3次。"
  },
  { 
    "roll": 36, 
    "名称": "传送点种子", 
    "原名": "Portal Seed", 
    "效果": "将此种子埋入土中可在该处培育传送门。24小时后传送门即可使用。通过此传送门可抵达任何其他已种植传送门种子的地点。对传送门造成任意魔法伤害即可将其摧毁。"
  },
  { 
    "roll": 37, 
    "名称": "典范之链", 
    "原名": "Paragon's Chain", 
    "效果": "每次长休时，你可以使用休息行动来冥想你所珍视的理想或原则，并将并的意志集中到链条中。在下一次长休之前，你可以花费一个希望，使用 d20 作为希望骰，进行与该原则一致的掷骰。"
  },
  { 
    "roll": 38, 
    "名称": "匿踪护身符", 
    "原名": "Elusive Amulet", 
    "效果": "每长休一次，激活此护符进入隐匿（Hidden）状态直至移动。以此法隐匿期间，即使敌人移动至通常能看见你的位置，你仍保持不可见状态。"
  },
  { 
    "roll": 39, 
    "名称": "希望守护者的小盒", 
    "原名": "Hopekeeper Locket", 
    "效果": "在长休期间，若你拥有6点希望值，可消耗1点希望值将丰沛的决心灌注于此挂坠中。当希望值归零时，可使用该挂坠立即获得1点希望值。挂坠必须重新灌注后才能再次以此法使用。"
  },
  { 
    "roll": 40, 
    "名称": "无限袋", 
    "原名": "Infinite Bag", 
    "效果": "放入此袋中的物品将存储在一个独立的次元中且可以随时取出。"
  },
  { 
    "roll": 41, 
    "名称": "神行遗宝", 
    "原名": "Stride Relic", 
    "效果": "敏捷+1，你不能同时持有其他遗宝。"
  },
  { 
    "roll": 42, 
    "名称": "强力遗宝", 
    "原名": "Bloster Relic", 
    "效果": "力量+1，你不能同时持有其他遗宝。"
  },
  { 
    "roll": 43, 
    "名称": "控制遗宝", 
    "原名": "Control Relic", 
    "效果": "灵巧+1，你不能同时持有其他遗宝。"
  },
  { 
    "roll": 44, 
    "名称": "调和遗宝", 
    "原名": "Attune Relic", 
    "效果": "本能+1，你不能同时持有其他遗宝。"
  },
  { 
    "roll": 45, 
    "名称": "魅力遗宝", 
    "原名": "Charm Relic", 
    "效果": "风度+1，你不能同时持有其他遗宝。"
  },
  { 
    "roll": 46, 
    "名称": "启迪遗宝", 
    "原名": "Enlighten Relic", 
    "效果": "知识+1，你不能同时持有其他遗宝。"
  },
  { 
    "roll": 47, 
    "名称": "珩磨遗宝", 
    "原名": "Honing Relic", 
    "效果": "你的一项经历+1，你不能同时持有其他遗宝"
  },
  { 
    "roll": 48, 
    "名称": "闪烁飞虫吊坠", 
    "原名": "Flickerfly Pendant", 
    "效果": "佩戴时，你的物理近战武器会像薄纱一样延伸，使你可以攻击邻近范围内的生物。"
  },
  { 
    "roll": 49, 
    "名称": "湖行者长靴", 
    "原名": "Lakestrider", 
    "效果": "你可以如同在柔软地面一般行走在水面上"
  },
  { 
    "roll": 50, 
    "名称": "粘土伙伴", 
    "原名": "Clay Companion", 
    "效果": "当你将这块陶土塑造成陶土动物伙伴时，它会表现出相应动物的特性。例如陶土蜘蛛能编织陶土蛛网，陶土飞鸟则可翱翔天际。陶土伙伴在不同形态间会保留记忆与身份认同，但每次变形都可能习得新的习性。"
  },
  { 
    "roll": 51, 
    "名称": "秘尘配方", 
    "原名": "Mythic Dust Recipe", 
    "效果": "在休息时间，花费一次休息动作和一包金币来制作一份秘尘。"
  },
  { 
    "roll": 52, 
    "名称": "记忆碎片", 
    "原名": "Shard of Memory", 
    "效果": "每长休一次，花费2点希望以回想一张宝库内的领域卡，而不是支付其回想费用。"
  },
  { 
    "roll": 53, 
    "名称": "欢欣宝石", 
    "原名": "Gem of Alacrity", 
    "效果": "附在武器上，允许你使用敏捷进行攻击掷骰。"
  },
  { 
    "roll": 54, 
    "名称": "威力宝石", 
    "原名": "Gem of Might", 
    "效果": "附在武器上，允许你使用力量进行攻击掷骰。"
  },
  { 
    "roll": 55, 
    "名称": "精准宝石", 
    "原名": "Gem of Precision", 
    "效果": "附在武器上，允许你使用灵巧进行攻击掷骰。"
  },
  { 
    "roll": 56, 
    "名称": "洞察宝石", 
    "原名": "Gem of Insight", 
    "效果": "附在武器上，允许你使用本能进行攻击掷骰。"
  },
  { 
    "roll": 57, 
    "名称": "无畏宝石", 
    "原名": "Gem of Audacity", 
    "效果": "附在武器上，允许你使用风度进行攻击掷骰。"
  },
  { 
    "roll": 58, 
    "名称": "睿智宝石", 
    "原名": "Gem of Sagacity", 
    "效果": "附在武器上，允许你使用知识进行攻击掷骰。"
  },
  { 
    "roll": 59, 
    "名称": "坚毅之戒", 
    "原名": "Ring of Unbreakable Resolve", 
    "效果": "每局游戏一次，当GM使用1点恐惧时，你可以花费4点希望以取消因为使用恐惧而产生的效应"
  },
  { 
    "roll": 60, 
    "名称": "团结腰带", 
    "原名": "Belt of Unity", 
    "效果": "每局游戏一次，你可以花费5点希望与3名角色进行接力掷骰，而不是2名。" 
  }
];